name = "JLPT N1 오답노트 1단원"
type = "word"
order = 3

nihongo_1234 = {
    "粘膜(ねんまく)": "점막",
    "如実に(にょじつに)": "여실히, 있는 그대로",
    "顕著に(けんちょに)": "현저하게",
    "諭す(さとす)": "잘 타이르다",
    "戒める(いましめる)": "훈계하다, 제지하다, 징계하다",
    "施錠(せじょう)": "자물쇠를 채움",
    "奔放な[性格](ほんぽうなせいかく)": "분방한(성격)",
    "阻まれる(はばまれる)": "저지되다, 막히다",
    "朗らかな(ほがらかな)": "명랑한",
    "治癒(ちゆ)": "치유",
    "慕う(したう)": "경모하다, 깊이 존경하다",
    "開拓(かいたく)": "개척",


    "手薄な(てうすな)": "허술한, 불충분한",
    "華々しい(はなばなしい)": "화려하다",
    "漠然と(ばくぜんと)": "막연히",
    "緩和(かんわ)": "완화",
    "中枢(ちゅうすう)": "중추",
    "随時(ずいじ)": "수시, 그때그때",
    "承諾(しょうだく)": "승낙",
    "勧める(すすめる)": "권하다",
    "嘆く(なげく)": "탄식하다",


    "辛抱(しんぼう)": "참음, 참고 견딤",
    "開拓(かいたく)": "개척",
    "是正(ぜせい)": "시정",
    "介護(かいご)": "간호",
    "鉢(はち)": "화분, 사발",
    "修行(しゅぎょう)": "수행, 불도를 닦음",
    "襲う(おそう)": "덮치다, 습격하다",
    "償い(つぐない)": "보상, 속죄",
    "陶器(とうき)": "도기, 도자기",


    "[成績を]たたえる(せいせきをたたえる)": "[성적을] 칭찬하다, 기리다",
	"[前市長の政策を]踏襲する(ぜんしちょうのせいさくをとうしゅうする)": "[이전 시장의 정책을] 답습하다",
	"がやがやと[騒がしい](がやがやとさわがしい)": "왁자지껄[소란스럽다]",
	"[何もできず]もどかしかった(なにもできずもどかしかった)": "[아무것도 할 수 없어] 애가 탔다",
	"ひしひしと[感じる](ひしひしとかんじる)": "절실히 [느끼다]",
	"[友達との関係が]ぎくしゃくしている(ともだちとのかんけいがぎくしゃくしている)": "[친구와의 관계가] 껄끄럽다, 어색하다",
	"ずっしりと[重い](ずっしりとおもい)": "묵직하다",

}

nihongo_5678 = {
    "むしょうに[食べたくなる](むしょうにたべたくなる)": "몹시 [먹고 싶어진다]",
    "[缶詰に]加工する(かんづめにかこうする)": "[통조림으로] 가공하다",
    "[話を]切り出す(はなしをきりだす)": "[이야기를] 꺼내다, 시작하다",
	"[コピー代を]立て替える(こぴーだいをたてかえる)": "[복사비를] 대신 치르다",
	"くよくよ[していないで]": "끙끙[대지 말고] → 사소한 일을 늘 걱정하는 모양",
	"基盤[を築いた](きばんをきずいた)": "기반[을 구축했다]",
	"[会話が]弾む(かいわがはずむ)": "[대화가] 활기를 띠다",


    "すばしこい": "민첩하다",
	"自覚(じかく)": "자각",
	"おどおど": "주뼛주뼛, 벌벌",
	"とぼける": "시치미를 떼다",
	"愛想(あいそ)": "붙임성",
	"ややこしい": "복잡하다, 까다롭다",
	"興じる(きょうじる)": "즐기다, 흥겨워하다",
	"ぼやける": "흐려지다",
	"ぶらぶら": "① 대롱대롱 ② 어슬렁어슬렁 ③ 빈둥빈둥",
	"振り出し(ふりだし)": "출발점, 처음 상태",
	"募集(ぼしゅう)": "모집",
	"つじつま": "사리, 이치",
	"一連(いちれん)": "①일련 ②일행",
	"うっとうしい": "①(기분·날씨) 음울하고 답답하다 ②귀찮다",
	"抑制(よくせい)": "억제",
	"どうにか": "그럭저럭, 겨우",
	"こつ": "요령",
	"きっちり": "꼭 맞는 모양",
	"明かす(あかす)": "밝히다, 털어놓다",
	"そっけない": "무정하다, 냉담하다",
	"到底(とうてい)": "도저히",


	"[この地方の]しきたり(このちほうのしきたり)": "(이 지방의) 관습, 관례",
	"ばててしまった": "지쳐 버렸다",
	"懸念される(けねんされる)": "염려되다, 우려되다",
	"規模(きぼ)": "규모",
	"無邪気な(むじゃきな)": "천진난만한",
	"たいして": "그다지, 별로",
	"[任務を]まっとうする(にんむをまっとうする)": "(임무를) 완수하다, 다하다",
	"あどけない[表情](あどけないひょうじょう)": "천진난만한 (표정)",
	"ぼやいている": "투덜거리고 있다",
	"[友人に]触発される(ゆうじんにしょくはつされる)": "(친구에게) 촉발되다, 자극되다",

	"おびえて": "무서워하고, 겁내고",
	"[改善する]手立て(かいぜんするてだて)": "(개선할) 방법, 방도",
	"しくじる": "망치다, 실패하다",
	"[その一言に]安堵した(そのひとことにあんどした)": "(그 한마디에) 안도했다",
	"[返事を]しぶっていた(へんじをしぶっていた)": "(대답을) 주저하고 있었다",
	"すみやかに[片づける](すみやかにかたづける)": "빨리, 신속히 (치우다)",
	"とまどって": "당황해",
	"張り合っている(はりあっている)": "경쟁하고 있다",
	"うろたえずに[対処した](うろたえずにたいしょした)": "당황하지 않고 (대처했다)",
	"ありありと[浮ぶ](ありありとうかぶ)": "뚜렷이, 똑똑히 (떠오르다)",
	"つぶさに": "자세히, 구체적으로",
	"ふいに[訪ねてきた](ふいにたずねてきた)": "느닷없이 (찾아왔다)",

}
    
nihongo_9101112 = {
	"[参加を]断念する(さんかをだんねんする)": "(참가를) 단념하다",
	"[出席者が]まばらだ(しゅっせきしゃがまばらだ)": "(참석자가) 드문드문하다",
	"おのずと[表れてくる](おのずとあらわれてくる)": "저절로, 자연히 (나타난다)",
	"[結果を聞いて]落胆する(けっかをきいてらくたんする)": "(결과를 듣고) 낙담하다",
	"不用意な[発言](ふよういなはつげん)": "조심성이 없는 (발언)",
	"はっきりしている": "분명하다",
	"[〜への進出を]もくろむ(〜へのしんしゅつをもくろむ)": "(~로의 진출을) 계획하다",
	"いやみ[を言われた](いやみをいわれた)": "빈정거림, 비아냥(을 들었다)",
	"[小説の結末は]あっけない(しょうせつのけつまつはあっけない)": "(소설의 결말은) 어이없다, 싱겁다",
	"先方[に確認する](せんぽうにかくにんする)": "상대편(에게 확인하다)",
	"仰天した(ぎょうてんした)": "깜짝 놀랐다",
	"手がかり[が欲しい](てがかりがほしい)": "단서(가 필요하다)",
	"雑踏[を抜けた](ざっとうをぬけた)": "혼잡한 곳(을 빠져나갔다)",
	"にわかには[信じられない](にわかにはしんじられない)": "당장에는 (믿을 수 없다)",

	"[友人たちから]問い詰められる(ゆうじんたちからといつめられる)": "(친구들에게) 추궁당하다",
	"[データの]重複(でーたのちょうふく)": "(데이터의) 중복",
	"ひたむきな[姿](ひたむきなすがた)": "한결같은 (모습)",
	"[壁が]もろくなる(かべがもろくなる)": "(벽이) 약해지다, 무너지기 쉽다",
	"ずばりと[指摘される](ずばりとしてきされる)": "딱 (지적되다) — 정곡을 정확히 찌르는 모양",
	"[問題を]提起(もんだいをていき)": "(문제를) 제기",
	"[失敗して]くじける(しっぱいしてくじける)": "(실패해서) 좌절하다",
	"[パソコンが]備え付けてある(ぱそこんがそなえつけてある)": "(컴퓨터가) 비치되어 있다",
	"[緊張して動作が]ぎこちない(きんちょうしてどうさがぎこちない)": "(긴장해서 동작이) 어색하다, 딱딱하다",


    "[予測に]合致する(よそくにがっちする)": "(예측에) 일치하다",
	"総じて[伸びている](そうじてのびている)": "대체로 (증가하고 있다) → 대체로, 일반적으로, 원래",
    "一律に[削減する](いちりつにさくげんする)": "일률적으로 (삭감하다)",
    "[母の足に]しがみつく(ははのあしにしがみつく)": "(엄마 다리에) 매달리다",
	"[情報を]入手(じょうほうをにゅうしゅ)": "(정보를) 입수",
    "[一人で]抱え込む(ひとりでかかえこむ)": "(혼자서) 떠안다",
	"質素な[生活](しっそなせいかつ)": "검소한 (생활)",
	"[地位を]退く(ちいをしりぞく)": "(지위에서) 물러나다",
    "[薬品の開発に]携わる(やくひんのかいはつにたずさわる)": "(약품 개발에) 종사하다",
    "[前向きな言葉とは]裏腹に(まえむきなことばとはうらはらに)": "(긍정적인 말과는) 달리, 정반대로",
    "心構え[が決まらない](こころがまえがきまらない)": "마음가짐, 각오(가 서지 않는다)",
    "[誰も来る]気配がない(だれもくるけはいがない)": "(아무도 올) 기색이 없다",



	"ぽつぽつ": "슬슬, 조금씩",
	"しなやか": "탄력이 있고 부드러운 모양, 유연함",
	"まるまる": "전부, 완전히",
	"突如(とつじょ)": "갑자기, 별안간",
    "兆し(きざし)": "조짐, 징조",
	"へりくだる": "겸손하다",
	"とぐ": "갈다",
	"どうやら": "어쩐지, 아무래도",

}