name = "JLPT N2 오답노트 3단원"
type = "sentence"
order = 3

nihongo_1 = {
    "やるからには": "하는 이상",
    "不思議なことに": "이상하게도",
    "彼の態度からして": "그의 태도부터가",
    "しばらく連絡がないからといって、そんなに心配することはないよ": "한동안 연락이 없다고 해서, 그렇게까지 걱정할 필요는 없어",
    "実際会ってみないことには": "실제로 만나보지 않으면",
    "責任感が強いうえに": "책임감이 강한 데다가",

    '急用ができたとかで': "급한 일이 생겼다고 해서",
    "興味深いことに": "흥미롭게도",
    "遠くを見るようにしたところ": "먼 곳을 보려고 해봤더니",

    "病気にたとえると": "병에 비유하면",

    "この仕事を選んだばかりに": "이 일을 선택한 탓에",
    "いつもながら": "언제나처럼",
    "驚いたことに": "놀랍게도",
    '酒を飲むどころではない': "술 마실 처지가 아니다",
    "よく効くうえに": "잘 듣는 데다가",
    "この仕事を引き受けるからには": "이 일을 맡는 이상",

    "嬉しいことに": "기쁘게도",
    "あの人が犯人だとは": "그 사람이 범인이라니",

}