name = "JLPT N1 3단원 문법 문장"
type = "sentence"
order = 2


nihongo_1 = {
	"どんな悪人であろうと(どんなあくにんであろうと)": "어떤 악인이더라도",
	"たばこの値段が上がろうと下がろうと(たばこのねだんがあがろうとさがろうと)": "담뱃값이 오르든 떨어지든",
	"雨だろうと雪だろうと(あめだろうとゆきだろうと)": "비가 오든 눈이 오든",
	"たとえ相手がどういうチームだろうと(たとえあいてがどういうちーむだろうと)": "설령 상대가 어떠한 팀이든",
	"周囲からどのような批判を浴びようとも(しゅういからどのようなひはんをあびようとも)": "주위에서 어떤 비판을 받더라도",
	"どんな反論をしようと自由だが(どんなはんろんをしようとじゆうだが)": "어떤 반론을 하든 자유지만",
	"雪だろうと雨だろうと(ゆきだろうとあめだろうと)": "눈이 오든 비가 오든",

	"鈴木さんという人は、他人がどんなに困ろうが、まったく気にかけない冷たい人だ(すずきさんというひとは、たにんがどんなにこまろうが、まったくきにかけないつめたいひとだ)": "스즈키 씨라는 사람은 다른 사람이 아무리 곤란해해도, 전혀 개의치 않는 매정한 사람이다",
	"あなたに反対されようと、私はやると決めたことは必ずやり遂げます(あなたにはんたいされようと、わたしはやるときめたことはかならずやりとげます)": "당신이 반대하더라도, 나는 하겠다고 결정한 것은 반드시 해냅니다",
	"彼が食べようが食べまいが、いちおう食事の準備はしなければならない(かれがたべようがたべまいが、いちおうしょくじのじゅんびはしなければならない)": "그가 먹든 먹지 않든, 일단 식사 준비는 해야 한다",
	"パーティーには参加しようとしまいと、みなさんの自由です(ぱーてぃーにはさんかしようとしまいと、みなさんのじゆうです)": "파티에 참가하든 하지 않든, 여러분의 자유입니다",
	"雪だろうと雨だろうと、試合は行う予定です(ゆきだろうとあめだろうと、しあいはおこなうよていです)": "눈이 오든 비가 오든, 시합은 할 예정입니다",


	"これでは、作ろうにも作れない(これでは、つくろうにもつくれない)": "이래서는 만들려고 해도 만들 수 없다",
	"家から出ようにも出られない(いえからでようにもでられない)": "집에서 나가려고 해도 나갈 수 없다",
	"大雪で交通が麻痺し、動こうにも動けない(おおゆきでこうつうがまひし、うごこうにもうごけない)": "대설로 교통이 마비되어 움직이려고 해도 움직일 수 없다",
	"歯が痛くて食べようにも食べられない(はがいたくてたべようにもたべられない)": "이가 아파서 먹으려고 해도 먹을 수 없다",

	"言うに言えない(いうにいえない)": "말할래야 말할 수 없다",
	"泣くに泣けず(なくになけず)": "울래야 울 수 없어",

	"やめるにやめられず困っている(やめるにやめられずこまっている)": "그만둘래야 그만둘 수 없어 난처하다",
	"先輩に聞こうにも聞けない(せんぱいにきこうにもきけない)": "선배에게 물어보려고 해도 물어볼 수 없다",
	"論文がまだ完成しないので、ディズニーランドへ遊びに行こうにも行けない(ろんぶんがまだかんせいしないので、でぃずにーらんどへあそびにいこうにもいけない)": "논문이 아직 완성되지 않아서, 디즈니랜드에 놀러 가려고 해도 갈 수 없다",
	"彼が会社をやめたのは、言うに言えない事情があったに違いない(かれがかいしゃをやめたのは、いうにいえないじじょうがあったにちがいない)": "그가 회사를 그만둔 것은 말할래야 말할 수 없는 사정이 있었음에 틀림없다",


	"信号がないのは危険極まりない(しんごうがないのはきけんきわまりない)": "신호등이 없는 것은 위험하기 짝이 없다",
	"彼の失礼極まりない態度(かれのしつれいきわまりないたいど)": "그의 무례하기 짝이 없는 태도",
	"私には退屈極まるものだった(わたしにはたいくつきわまるものだった)": "나에게는 너무 지루했다",

	"失礼極まりない(しつれいきわまりない)": "무례하기 짝이 없다",
	"危険極まりない行為だ(きけんきわまりないこういだ)": "위험하기 짝이 없는 행위이다",
	"私は、店員の失礼きわまりない態度に我慢がならなかった(わたしは、てんいんのしつれいきわまりないたいどにがまんがならなかった)": "나는 점원의 무례하기 짝이 없는 태도에 참을 수 없었다",
	"田中太郎さん以外誰も知らない私は「パーティーに行っても退屈極まるだろう」と思った(たなかたろうさんいがいだれもしらないわたしは「ぱーてぃーにいってもたいくつきわまるだろう」とおもった)": "다나카 타로 씨 외에 아무도 모르는 나는 ‘파티에 가도 너무 지루할거야’라고 생각했다",


	"彼ごとき青二才(かれごときあおにさい)": "그와 같은 풋내기",
	"私のごとき未熟者に(わたしのごときみじゅくものに)": "저 같은 미숙한 자에게",
	"事件には関係していないかのごとく(じけんにはかんけいしていないかのごとく)": "사건에는 관계하고 있지 않은 것처럼",
	"飛ぶがごとく売れる(とぶがごとくうれる)": "날개 돋힌 듯이 팔리다",
	"予想したごとく(よそうしたごとく)": "예상한 것처럼",

	"あたかも他人を眺めるがごとく(あたかもたにんをながめるがごとく)": "마치 타인을 바라보는 것처럼",
	"私ごとき新人に務まるのかと(わたしごときしんじんにつとまるのかと)": "나 같은 신입이 감당해낼 수 있을까 하고",
	"あたかも事実であるかのごとく(あたかもじじつであるかのごとく)": "마치 사실인 것처럼",
	"君ごとき人間には、僕の気持ちは分からないだろう(きみごときにんげんには、ぼくのきもちはわからないだろう)": "너 같은 인간은, 내 기분은 모를 거야",
	"降る雪は、花が散るかのごとく見えた(ふるゆきは、はながちるかのごとくみえた)": "내리는 눈은 꽃이 떨어지는 것처럼 보였다",


	"自然への影響を考えることなしには(しぜんへのえいきょうをかんがえることなしには)": "자연에 대한 영향을 고려하지 않고는",
	"他人を犠牲にすることなしに(たにんをぎせいにすることなしに)": "타인을 희생시키지 않고",
	"友を見捨てることなく(ともをみすてることなく)": "친구를 버리지 않고",
	"信念をまげることなく(しんねんをまげることなく)": "신념을 굽히지 않고",

	"どんな困難に遭ってもそれに負けることなく(どんなこんなんにあってもそれにまけることなく)": "어떤 어려움을 당하더라도 그것에 지지 않고",
	"住民の同意を得ることなしに(じゅうみんのどういをえることなしに)": "주민의 동의를 얻지 않고",
	"患者を待たせることなく(かんじゃをまたせることなく)": "환자를 기다리게 하지 않고",
	"事実関係を確認することなしに(じじつかんけいをかくにんすることなしに)": "사실 관계를 확인하지 않고",
	"失敗をおそれることなく行動してほしい(しっぱいをおそれることなくこうどうしてほしい)": "실패를 두려워하지 않고 행동해 주었으면 한다",


	"ついには居眠り運転で事故を起こしてしまつだ(ついにはいねむりうんてんでじこをおこしてしまつだ)": "결국에는 졸음 운전으로 사고를 일으키는 꼴이다",
	"ついには家出までするしまつだ(ついにはいえでまでするしまつだ)": "결국에는 가출까지 하는 꼴이다",
	"ああでもない、こうでもないと迷惑をかけたあげく、あのしまつだ(ああでもない、こうでもないとめいわくをかけたあげく、あのしまつだ)": "이것도 아니고 저것도 아니라면서 폐를 끼친 끝에 저 모양이다",

	"しまいには大雨に降られてずぶぬれになる始末だった(しまいにはおおあめにふられてずぶぬれになるしまつだった)": "결국에는 큰 비를 맞아 흠뻑 젖은 꼴이었다",
	"階段で転んで足を痛めてしまい、病院に通う始末だ(かいだんでころんであしをいためてしまい、びょういんにかようしまつだ)": "계단에서 굴러서 발을 다쳐, 병원에 다니는 형편이다",
	"ああした方がいい、こうした方がいいと大騒ぎしたあげく、このしまつだ(ああしたほうがいい、こうしたほうがいいとおおさわぎしたあげく、このしまつだ)": "이렇게 하는 게 낫다, 저렇게 하는 게 낫다며 큰 소란을 피운 끝에 이 모양이다",


	"スイッチの入れ方すら知らない人(すいっちのいれかたすらしらないひと)": "스위치를 켜는 방법도 모르는 사람",
	"一人では食事すらできない(ひとりではしょくじすらできない)": "혼자서는 식사조차 할 수 없다",
	"温厚なあの人でさえ(おんこうなあのひとでさえ)": "온후한 그 사람조차",
	"大学生の僕にさえ難しい(だいがくせいのぼくにさえむずかしい)": "대학생인 나도 어렵다",

	"言語感覚すら変えてしまう(げんごかんかくすらかえてしまう)": "언어감각조차 바뀌어버린다",
	"経験を積んだ昆虫学者でさえも(けいけんをつんだこんちゅうがくしゃでさえも)": "경험을 쌓은 곤충학자조차도",
	"40度も熱があって、起きあがることすらできない(よんじゅうどもねつがあって、おきあがることすらできない)": "열이 40도나 되어서 일어날 수조차 없다",
	"今の調子では、予選に出ることさえむずかしい(いまのちょうしでは、よせんにでることさえむずかしい)": "지금 상태로는 예선에 나가는 것도 어렵다",


	"チームのキャプテンだけあって(ちーむのきゃぷてんだけあって)": "팀의 주장인 만큼",
	"さすが学生時代にやっていただけあって(さすががくせいじだいにやっていただけあって)": "과연 학생시절에 했었던 만큼",
	"長い間楽しみに待っていただけに(ながいあいだたのしみにまっていただけに)": "오랫동안 기대하며 기다리고 있었던 만큼",
	"苦労して作った本だけに(くろうしてつくったほんだけに)": "고생해서 만든 책인 만큼",
	"年が年だけに(としがとしだけに)": "나이가 나이인 만큼",
	"値段が値段だけに(ねだんがねだんだけに)": "가격이 가격인 만큼",
	"さすがに元アナウンサーだっただけのことはあるね(さすがにもとあなうんさーだっただけのことはあるね)": "과연 전 아나운서라 할 만하네",
	"チャンピオンだけのことはある(ちゃんぴおんだけのことはある)": "챔피언이라 할 만한 값어치를 하다",

	"魚屋も経営しているだけあって(さかなやもけいえいしているだけあって)": "생선 가게도 경영하고 있는 만큼",
	"時期が時期だけに混雑していた(じきがじきだけにこんざつしていた)": "시기가 시기인 만큼 혼잡했다",
	"絶対に勝ちたい相手だっただけに(ぜったいにかちたいあいてだっただけに)": "꼭 이기고 싶은 상대였던 만큼",
	"幼稚園の先生をしていただけあって(ようちえんのせんせいをしていただけあって)": "유치원 선생님을 했었던 만큼",

	"日本有数の水量を誇るだけあって(にほんゆうすうのすいりょうをほこるだけあって)": "일본 굴지의 수량을 자랑하는 만큼",
	"野菜不足になりがちだけに(やさいぶそくになりがちだけに)": "채소가 부족해지기 쉬운 만큼",
	"文句のつけようがないだけに(もんくのつけようがないだけに)": "트집을 잡을 수 없을 만큼",
	"料理が上手な森さんが勧めるだけあって(りょうりがじょうずなもりさんがすすめるだけあって)": "요리를 잘하는 모리 씨가 추천하는 만큼",

	"日本一のすし屋の娘だけあって、彼女はさすがに魚の種類に詳しい(にっぽんいちのすしやのむすめだけあって、かのじょはさすがにさかなのしゅるいにくわしい)": "일본 제일의 초밥집 딸인 만큼, 그녀는 과연 생선의 종류를 잘 안다",
	"大きな事故にもつながりかねないだけに、より安全で丈夫に製造してほしいです(おおきなじこにもつながりかねないだけに、よりあんぜんでじょうぶにせいぞうしてほしいです)": "큰 사고로 이어질지도 모르는 만큼, 보다 안전하고 튼튼하게 제조하길 바랍니다",
	"この松茸は最高品だけど、産地直売だけのことはあってめちゃくちゃ安い(このまつたけはさいこうひんだけど、さんちちょくばいだけのことはあってめちゃくちゃやすい)": "이 송이버섯은 최상품이지만, 산지 직매라 할 만하게 굉장히 싸다",


	"5分だけで一人分の料理ができる(ごふんだけでひとりぶんのりょうりができる)": "5분 만에 1인분 요리가 나온다",
	"1日1文字ずつ書くだけで(いちにちいちもじずつかくだけで)": "하루 한 글자씩 쓰기만 해도",
	"見た目だけでは分からない(みためだけではわからない)": "겉보기만으로는 알 수 없다",
	"無理だったら断るだけのことだ(むりだったらことわるだけのことだ)": "무리라면 거절할 뿐이다",

	"この書類を預けてくれればいいだけのことだから(このしょるいをあずけてくれればいいだけのことだから)": "이 서류를 맡아주면 될 뿐이니까",
	"見ているだけでほっとする(みているだけでほっとする)": "보고 있기만 해도 안심이 된다",
	"ブラウス1枚選ぶだけのことなのに(ぶらうすいちまいえらぶだけのことなのに)": "블라우스 한 장 고를 뿐인데",
	"資格を取っただけで希望の職につけるほど(しかくをとっただけできぼうのしょくにつけるほど)": "자격을 취득하기만 해도 희망하는 직업을 갖게 될 만큼",
	"レシピに沿って料理するだけで(れしぴにそってりょうりするだけで)": "레시피에 따라 요리하기만 해도",
	"単に実力が足りなかっただけのことだ(たんにじつりょくがたりなかっただけのことだ)": "그저 실력이 부족했을 뿐이다",
	"自分に合った枕に変えるだけで(じぶんにあったまくらにかえるだけで)": "자신에게 맞는 베개로 바꾸기만 해도",

	"旅行に行くことを考えるだけで楽しくなってくる(りょこうにいくことをかんがえるだけでたのしくなってくる)": "여행가는 것을 생각하기만 해도 즐거워진다",
	"テクニックの向上だけでは試合で勝つことはできません(てくにっくのこうじょうだけではしあいでかつことはできません)": "테크닉의 향상만으로는 시합에서 이길 수 없습니다",
	"ちょっと熱が出たというだけのことで、医者を呼ぶのは大げさすぎる(ちょっとねつがでたというだけのことで、いしゃをよぶのはおおげさすぎる)": "열이 좀 났다는 것만으로 의사를 부르는 것은 너무 거창하다",


	"やったらやったで(やったらやったで)": "하면 하는 대로",
	"片づけたら片づけたで(かたづけたらかたづけたで)": "치우면 치우는 대로",
	"夏は夏で暑いし(なつはなつであついし)": "여름은 여름대로 덥고",

	"あったらあったで、きっと遊んでしまうのだろう(あったらあったできっとあそんでしまうのだろう)": "있으면 있는 대로 분명 놀아버릴 것이다",
	"大人は大人で大変なことがある(おとなはおとなでたいへんなことがある)": "어른은 어른대로 힘든 일이 있다",
	"自分が決めたことならそれはそれで(じぶんがきめたことならそれはそれで)": "자신이 정한 일이라면 그건 그거대로",
	"息子には大学に受かってほしいが、受かったら受かったでお金が要って大変だ(むすこにはだいがくにうかってほしいが、うかったらうかったでおかねがいってたいへんだ)": "아들이 대학에 합격하길 바라지만, 합격하면 합격하는 대로 돈이 들어서 큰일이다",
	"始末書を出したのなら、それはそれでいい(しまつしょをだしたのなら、それはそれでいい)": "시말서를 제출했다면 그건 그거대로 됐어",

}

nihongo_2 = {
	"階段を使ったほうがいいと思いつつ(かいだんをつかったほうがいいとおもいつつ)": "계단을 사용하는 게 좋다고 생각하면서도",
	"体に悪いと知りつつも(からだにわるいとしりつつも)": "몸에 나쁜 줄 알면서도",
	"勢力はおとろえつつある(せいりょくはおとろえつつある)": "세력은 쇠퇴하고 있다",

	"優良企業の条件の一つとなりつつある(ゆうりょうきぎょうのじょうけんのひとつとなりつつある)": "우량기업의 조건 중 하나가 되고 있다",
	"大学に通いつつ仕事をしていた(だいがくにかよいつつしごとをしていた)": "대학에 다니면서 일을 하고 있었다",
	"急激に高まりつつある(きゅうげきにたかまりつつある)": "급격하게 고조되고 있다",
	"今まで欲しいと思いつつ(いままでほしいとおもいつつ)": "지금까지 갖고 싶다고 생각하면서",
	"メリットは理解しつつも(めりっとはりかいしつつも)": "장점은 이해하면서도",
	"母親は口では子供を叱りつつも、心の中では子供がかわいくてたまらないのです(ははおやはくちではこどもをしかりつつも、こころのなかではこどもがかわいくてたまらないのです)": "어머니는 말로는 아이를 야단치면서도, 마음속으로는 아이가 귀여워서 견딜 수가 없습니다",
	"失われつつある自然を守ろうと、市民たちは運動を始めた(うしなわれつつあるしぜんをまもろうと、しみんたちはうんどうをはじめた)": "상실되고 있는 자연을 지키려고 시민들은 운동을 시작했다",


	"子どもじゃあるまいし(こどもじゃあるまいし)": "어린애도 아니고",
	"役者でもあるまいし(やくしゃでもあるまいし)": "배우도 아니고",
	"元気ではあるまい(げんきではあるまい)": "건강하지 않을 거라고 생각했다",

	"何週間も海外に行くわけじゃあるまいし(なんしゅうかんもかいがいにいくわけじゃあるまいし)": "몇 주나 해외에 가는 것도 아니고",
	"夫婦二人で遊園地でもあるまいし(ふうふふたりでゆうえんちでもあるまいし)": "부부 둘이서 유원지(에 가는 것)도 좀 아닐테고",
	"たいそうな小説でもあるまい(たいそうなしょうせつでもあるまい)": "대단한 소설도 아닐 것이다",
	"君ではあるまいし、そんな話にはだまされないよ(きみではあるまいし、そんなはなしにはだまされないよ)": "(내가) 너도 아닌데, 그런 말에는 안 속아",
	"「どうせ大したものが入っているわけではあるまい」と思ったものの、結局買ってしまった(どうせたいしたものがはいっているわけではあるまいとおもったものの、けっきょくかってしまった)": "‘어차피 대단한 게 들어 있는 것도 아닐 거야’라고 생각했지만, 결국 사고 말았다",


	"人前で演技するのは初めての経験とあって(ひとまえでえんぎするのははじめてのけいけんとあって)": "다른 사람 앞에서 연기를 하는 건 처음이었는 경험이라서",
	"待ちに待った夏休みがやっと始まったとあって(まちにまったなつやすみがやっとはじまったとあって)": "기다리고 기다리던 여름방학이 드디어 시작되었어서",
	"親友の頼みとあっては、断るわけにはいかない(しんゆうのたのみとあっては、ことわるわけにはいかない)": "친한 친구의 부탁이라면 거절할 수는 없다",
	"自分の恋人の悪口を言われたとあっては(じぶんのこいびとのわるぐちをいわれたとあっては)": "자기 연인의 험담을 들었다면",
	"社長の命令とあれば(しゃちょうのめいれいとあれば)": "사장의 명령이라면",
	"彼はお金のためとあれば(かれはおかねのためとあれば)": "그는 돈을 위해서라면",

	"A氏の講演会が無料とあって(えーしのこうえんかいがむりょうとあって)": "A씨의 강연회가 무료라서",
	"初めて一般に公開されるとあっては(はじめていっぱんにこうかいされるとあっては)": "처음으로 일반에게 공개된다면",
	"10年に一度のお祭りとあって(じゅうねんにいちどのおまつりとあって)": "10년에 한 번 있는 축제라서",
	"君がうそをついたとあっては許すわけにはいかない(きみがうそをついたとあってはゆるすわけにはいかない)": "자네가 거짓말을 한 거라면 용서할 수는 없어",
	"最近の親は、子どものためとあれば出費を惜しまない(さいきんのおやは、こどものためとあればしゅっぴをおしまない)": "요즘 부모는 자녀를 위해서라면 지출을 아끼지 않는다",


	"彼女にとっては単なる遊びというところだ(かのじょにとってはたんなるあそびというところだ)": "그녀에게는 단순한 놀이 정도다",
	"山田さんにとってはちょうどいい散歩といったところだ(やまださんにとってはちょうどいいさんぽといったところだ)": "야마다 씨에게는 딱 좋은 산책 정도이다",
	"時給は700円から1000円といったところだ(じきゅうはななひゃくえんからせんえんといったところだ)": "시급은 기껏해야 700엔에서 1000엔이다",
	"今年のできは、まあまあといったところだ(ことしのできは、まあまあといったところだ)": "올해 쌀 작황은 그저 그런 정도이다",

	"2時間半といったところでしたから(にじかんはんといったところでしたから)": "기껏해야 2시간 반이었으니까",
	"中古は高くても4、5万円といったところだ(ちゅうこはたかくてもよん、ごまんえんといったところだ)": "중고는 비싸도 잘해야 4, 5만 엔이다",
	"家の建築費は少なめに見積もっても2千万円というところだろう(いえのけんちくひはすくなめにみつもってもにせんまんえんというところだろう)": "집 건축비는 적게 어림잡아도 2천만 엔 정도일 것이다",
	"店はだいぶ軌道に乗ってきたが、それでもまだ収支トントンといったところだ(みせはだいぶきどうにのってきたが、それでもまだしゅうしトントンといったところだ)": "가게는 상당히 궤도에 올랐지만, 그래도 아직 수지가 엇비슷한 정도다",


	"彼の喜びようといったらなかった(かれのよろこびようといったらなかった)": "그의 기뻐하는 모습은 말로 표현할 수 없었다",
	"弟のあわてようといったらなかった(おとうとのあわてようといったらなかった)": "남동생의 당황하는 모습은 말로 표현할 수가 없었다",
	"腹立たしいといったらありゃしない(はらだたしいといったらありゃしない)": "정말이지 너무 화가 났다",
	"自分の案が採用されたときのうれしさといったらない(じぶんのあんがさいようされたときのうれしさといったらない)": "내 구성안이 채용되었을 때는 기쁘기 이를 데 없다",

	"毎日遅刻せずに会社に来るとはいえ、その仕事ぶりはひどいといったらない(まいにちちこくせずにかいしゃにくるとはいえ、そのしごとぶりはひどいといったらない)": "매일 지각하지 않고 회사에 온다고는 해도, 그 근무태도는 심하기 이를 데 없다",
	"8時間必死で働いて、たったの2千円。ばかばかしいといったらありゃしない(はちじかんひっしではたらいて、たったのにせんえん。ばかばかしいといったらありゃしない)": "8시간 필사적으로 일하고 겨우 2천 엔. 정말이지 어처구니가 없다",


	"さぞや明るい男だと思いきや(あかるいおとこだとおもいきや)": "필시 명랑한 남자라고 생각했는데",
	"もうとても追いつけないだろうと思いきや(もうとてもおいつけないだろうとおもいきや)": "이제 도저히 따라잡을 수 없을 거라고 생각했는데",
	"さぞかし泳ぎがうまいだろうと思いきや(さぞかしおよぎがうまいだろうとおもいきや)": "수영을 잘할 거라고 생각했는데",
	"役作りに悩んでいるのかと思いきやそうでもない(やくづくりになやんでいるのかとおもいきやそうでもない)": "배역에 대한 연구로 고민하고 있는가 생각했는데 그렇지도 않다",

	"たくさん人が並んでいたので待たされるかと思いきや(たくさんひとがならんでいたのでまたされるかとおもいきや)": "사람들이 많이 줄 서 있어서 기다리게 되나 생각했는데",
	"てっきり二人は結婚すると思いきや(てっきりふたりはけっこんするとおもいきや)": "틀림없이 두 사람은 결혼할 거라고 생각했는데",


	"うちの会社の部長ときたら(うちのかいしゃのぶちょうときたら)": "우리 회사 부장으로 말할 것 같으면",
	"最近、父ときたら(さいきん、ちちときたら)": "요즘 아버지는",
	"この時計ったら(このとけいったら)": "이 시계는",

	"山田君ときたら(やまだくんときたら)": "야마다 군으로 말할 것 같으면",
	"私ったら(わたしったら)": "나 좀 봐",

	"山田君ときたら、ゲーム好きでせっかく働いたアルバイト代もすべて使ってしまうらしい(やまだくんときたら、げーむずきでせっかくはたらいたあるばいとだいもすべてつかってしまうらしい)": "야마다 군으로 말할 것 같으면, 게임을 좋아해서 모처럼 일한 아르바이트비도 전부 써버리는 모양이다",
	"あら、いやだ。私ったら、てっきり男の方だとばかり思ってました(あら、いやだ。わたしったら、てっきりおとこのかただとばかりおもってました)": "어머, 이런~ 나 좀 봐. 틀림없이 남성분인 줄만 알고 있었어요",


	"本日はお忙しいところを(ほんじつはおいそがしいところを)": "오늘은 바쁘신 중에",
	"犯人は買い物をしていたところを(はんにんはかいものをしていたところを)": "범인은 쇼핑을 하던 중에",
	"危ないところを(あぶないところを)": "위험한데도",
	"昼寝していたところを(ひるねしていたところを)": "낮잠을 자던 중에",
	"もう少しで完成するところを(もうすこしでかんせいするところを)": "조금만 더하면 완성하는데",

	"わなにかかって苦しんでいるところを(わなにかかってくるしんでいるところを)": "덫에 걸려 괴로워하고 있는 중에",
	"「御社で」と言うべきところを(「おんしゃで」というべきところを)": "「귀사에서」라고 말해야 되는데",
	"先日はお忙しいところをおいでくださいまして、本当にありがとうございました。(せんじつはおいそがしいところをおいでくださいまして、ほんとうにありがとうございました)": "일전에는 바쁘신 중에 와 주셔서 정말로 감사했습니다",
	"本来は「政府が」と言うべきところを「国が」と言っていることがあります。(ほんらいは「せいふが」というべきところを「くにが」といっていることがあります)": "본래는 「정부가」라고 말해야 되는데 「나라가」라고 말하는 경우가 있습니다",


	"そんな簡単なこともできないとは(そんなかんたんなこともできないとは)": "그런 간단한 것도 못하다니",
	"部下からそんなことを言われるとは(ぶかからそんなことをいわれるとは)": "부하에게 그런 말을 들으리라고는",
	"そこまで言うとは(そこまでいうとは)": "그렇게까지 말하다니",
	"彼も相当なものだ(かれもそうとうなものだ)": "그 사람도 보통은 아니다",

	"間違い電話をかけてきて謝りもしないとは(まちがいでんわをかけてきてあやまりもしないとは)": "전화를 잘못 걸고 사과도 하지 않다니",
	"ブラウス１枚選ぶだけのことなのに４時間もかかるとは(ぶらうすいちまいえらぶだけのことなのによじかんもかかるとは)": "블라우스 한 장 고를 뿐인데 4시간이나 걸리다니",
	"高校レベルの数学の問題をすらすらと解けるとは(こうこうれべるのすうがくのもんだいをすらすらととけるとは)": "고등학교 수준의 수학문제를 척척 풀다니",
	"あの強いチームが初出場チームに敗れるとは、全く予想外だった(あのつよいちーむがはつしゅつじょうちーむにやぶれるとは、まったくよそうがいだった)": "그 강한 팀이 첫 출전 팀에게 패하다니 전혀 예상 밖이었다",


	"任務とはいえ(にんむとはいえ)": "임무라고는 해도",
	"C社に対抗するためとはいえ(しーしゃにたいこうするためとはいえ)": "C사에 대항하기 위해서라고는 해도",
	"昔に比べて体力が衰えたとはいえ(むかしにくらべてたいりょくがおとろえたとはいえ)": "옛날에 비해 체력이 떨어졌다고는 해도",
	"そうなることは初めからわかっていたとはいえ(そうなることははじめからわかっていたとはいえ)": "그렇게 될 것은 처음부터 알고 있었다고는 해도",

	"とはいえ、コミュニケーション能力をめぐる過当な競争は(とはいえ、こみゅにけーしょんのうりょくをめぐるかとうなきょうそうは)": "그렇다고는 해도 커뮤니케이션 능력을 둘러싼 지나친 경쟁은",
	"男女平等とはいえ、女性が社会に出て働くうえでまだまだ不合理な制度が多い(だんじょびょうどうとはいえ、じょせいがしゃかいにでてはたらくうえでまだまだふごうりなせいどがおおい)": "남녀평등이라고는 해도 여성이 사회에 나가서 일하는 데 있어서 아직도 불합리한 제도가 많다",
}

nihongo_3 = {


	"テレビを見るともなしに見ていた(てれびをみるともなしにみていた)": "텔레비전을 무심코 보고 있었다",
	"日本の民謡を聞くともなしに聞いている(にほんのみんようをきくともなしにきいている)": "일본 민요를 무심코 듣고 있자니",
	"となりの席の話を聞くともなく聞いていたら(となりのせきのはなしをきくともなくきいていたら)": "옆 자리의 이야기를 무심코 듣고 있었더니",
	"電車の窓から外を見るともなく見ていたら(でんしゃのまどからそとをみるともなくみていたら)": "전철 창문으로 밖을 무심코 보고 있었더니",

	"反対のホームを見るともなしに見ていたら、昔別れた恋人の姿が見えた(はんたいのほーむをみるともなしにみていたら、むかしわかれたこいびとのすがたがみえた)": "반대편 승강장을 무심코 보고 있었더니, 옛날에 헤어진 애인의 모습이 보였다",
	"電車の中で、聞くともなく隣に座った高校生たちの話を聞いていた(でんしゃのなかで、きくともなくとなりにすわったこうこうせいたちのはなしをきいていた)": "전철 안에서 무심코 옆자리에 앉은 고등학생들의 이야기를 듣고 있었다",


	"休日ともなると(きゅうじつともなると)": "휴일이라도 되면",
	"さすが一流の選手ともなると(さすがいちりゅうのせんしゅともなると)": "역시 일류 선수쯤 되면",
	"世界的な俳優ともなれば(せかいてきなはいゆうともなれば)": "세계적인 배우쯤 되면",
	"日本での生活も10年ともなれば(にほんでのせいかつもじゅうねんともなれば)": "일본에서의 생활도 10년쯤 되면",

	"家庭を犠牲にしてまでとなると(かていをぎせいにしてまでとなると)": "가정을 희생하면서까지쯤 되면",
	"週末ともなれば家族連れでいっぱいだ(しゅうまつともなればかぞくづれでいっぱいだ)": "주말이라도 되면 가족동반으로 가득하다",
	"一国の首相ともなると、忙しくてゆっくり家族旅行などしてはいられないだろう(いっこくのしゅしょうともなると、いそがしくてゆっくりかぞくりょこうなどしてはいられないだろう)": "한 나라의 수쯤 되면, 바빠서 여유롭게 가족 여행 같은 것은 하고 있을 수 없을 것이다",
	"動物の世界ではボスともなれば、縄張りを守るために命をかけて戦わねばならない(どうぶつのせかいではぼすともなれば、なわばりをまもるためにいのちをかけてたたかわねばならない)": "동물의 세계에서는 보스쯤 되면, 자기 영역을 지키기 위해서 목숨을 걸고 싸워야 한다",

	"国は計画を中止するとまでは言わないまでも(くにはけいかくをちゅうしするとまではいわないまでも)": "국가는 계획을 중지한다고까지는 말하지 않더라도",
	"天才とは言わないまでも(てんさいとはいわないまでも)": "천재라고까지는 하지 않더라도",
	"徹夜はしないまでも(てつやはしないまでも)": "철야까지는 하지 않더라도",
	"見舞いに来ないまでも(みまいにこないまでも)": "병문안까지는 오지 않더라도",

	"解決には至らないまでも(かいけつにはいたらないまでも)": "해결까지는 이르지 않더라도",
    "手品のプロにはならないまでも、これを使って人を喜ばせることができたらいい(てじなのぷろにはならないまでも、これをつかってひとをよろこばせることができたらいい)": "프로 마술사까지는 되지 않더라도, 이것을 이용해 남을 기쁘게 할 수 있으면 된다",


    "子どもながらも(こどもながらも)": "어리지만, 어린데도",
    "貧しいながらも(まずしいながらも)": "가난하지만",
    "休養に徹すると言いながらも(きゅうようにてっするといいながらも)": "철저히 쉬겠다고 말하면서도",
    "様々な苦難にありながらも(さまざまなくなんにありながらも)": "여러 고난을 겪으면서도",

	"なんだか使いにくいと言いながらも(なんだかつかいにくいといいながらも)": "왠지 사용하기 어렵다고 말하면서도",
	"苦労の末に手に入れた2DKの部屋は、狭いながらも楽しいわが家だ(くろうのすえにてにいれたにーでぃーけーのへやは、せまいながらもたのしいわがやだ)": "고생 끝에 구입한 2DK의 방은 좁지만 즐거운 우리 집이다",


	"涙なくしては語れない (なみだなくしてはかたれない)": "눈물 없이는 말할 수 없다",
	"市民の皆さんの協力なくして (しみんのみなさんのきょうりょくなくして)": "시민 여러분의 협력 없이",
	"先生方のご指導や友人の助けなしには (せんせいがたのごしどうやゆうじんのたすけなしには)": "선생님의 지도와 친구의 도움 없이는",
	"事前の連絡なしに会社を休んだ (じぜんのれんらくなしにかいしゃをやすんだ)": "사전 연락 없이 회사를 쉬었다",
	"それなくして会社の成長など望みようもない (それなくしてかいしゃのせいちょうなどのぞみようもない)": "그것 없이 회사의 성장 따위 바랄 수도 없다",
	"労働条件の改善なくして (ろうどうじょうけんのかいぜんなくして)": "근로조건의 개선 없이",
	"皆様のご協力なくしては、とてもこの事業は達成できなかったであろう。 (みなさまのごきょうりょくなくしては、とてもこのじぎょうはたっせいできなかったであろう。)": "여러분의 협력 없이는, 도저히 이 사업은 달성할 수 없었을 것이다",
	"先生方のご指導や先輩の助けなしには、卒論は書き上げられなかっただろう。 (せんせいがたのごしどうやせんぱいのたすけなしには、そつろんはかきあげられなかっただろう。)": "선생님의 지도와 선배의 도움 없이는, 졸업 논문은 완성할 수 없었을 것이다",
    

	"一流ホテルならではの豪華な雰囲気 (いちりゅうホテルならではのごうかなふんいき)": "일류 호텔만의 호화로운 분위기",
	"ベテラン技術者ならではの素晴らしいアイディア (ベテランぎじゅつしゃならではのすばらしいアイディア)": "베테랑 기사만의 훌륭한 아이디어",
	"その地方ならではの名産がある (そのちほうならではのめいさんがある)": "그 지방 특유의 명산품이 있다",
	"店の装飾やサービスに一流の店ならではの品 (みせのそうしょくやサービスにいちりゅうのみせならではのひん)": "가게 장식이나 서비스에 일류 상점만의 품격",
	"同世代ならではの話 (どうせだいならではのはなし)": "같은 연령층끼리 통하는 이야기",
	"老舗旅館ならではの細やかな心遣い (しにせりょかんならではのこまやかなこころづかい)": "대대로 이어온 여관만의 세심한 배려",
	"海の町ならではの新鮮な魚料理 (うみのまちならではのしんせんなさかなりょうり)": "바닷마을만의 신선한 생선 요리",
	"今度の学園祭にはわがクラスならではの展示をしたいものだが、何かいい企画はないか (こんどのがくえんさいにはわがクラスならではのてんじをしたいものだが、なにかいいきかくはないか)": "이번 학교 축제에는 우리 반 특유의 전시를 하고 싶은데, 뭔가 좋은 기획은 없을까?",


	"わたしなりに (わたしなりに)": "제 나름대로",
	"その人なりの生き方や生きがい (そのひとなりのいきかたやいきがい)": "그 사람 나름의 생활방식이나 보람",
	"あなたなりのお考えがおありでしょうが (あなたなりのおかんがえがおありでしょうが)": "당신 나름대로의 생각이 있으시겠지만",
	"それなりに効率よく走れるものができたと思う (それなりにこうりつよくはしれるものができたとおもう)": "그런대로 효율적으로 달릴 수 있는 것이 생겼다고 생각한다",
	"私が有名な大学に入れたのは、自分なりに一生懸命勉強したからだと思います。 (わたしがゆうめいなだいがくにはいれたのは、じぶんなりにいっしょうけんめいべんきょうしたからだとおもいます)": "제가 유명한 대학에 들어갈 수 있었던 것은, 제 나름대로 열심히 공부했기 때문이라고 생각합니다",
	"若い人には若い人なりの考えがあるだろう。 (わかいひとにはわかいひとなりのかんがえがあるだろう)": "젊은 사람에게는 젊은 사람 나름의 생각이 있을 것이다",

	"それなりに (それなりに)": "그런대로, 그 나름대로",
	"それなりの (それなりの)": "그런대로의",


	"父は責任者という立場にあって (ちちはせきにんしゃというたちばにあって)": "아버지는 책임자라는 입장에서",
	"水も食糧もない状況にあっては (みずもしょくりょうもないじょうきょうにあっては)": "물도 식량도 없는 상황에서는",
	"就職難の時代にあって (しゅうしょくなんのじだいにあって)": "취직난의 시대에",
	"この非常時にあっていかにすべきか (このひじょうじにあっていかにすべきか)": "이 비상시에 어떻게 해야 할 것인가",
	"交流が活発化した現代にあっては (こうりゅうがかっぱつかしたげんだいにあっては)": "교류가 활발해진 현대에서는",
	"成果が重視されがちな時代にあって (せいかがじゅうしされがちなじだいにあって)": "성과가 중시되기 쉬운 시대에서",
	"彼女はクラス担任という立場にあって、内申管理および進学指導などを公平にしなければならない。 (かのじょはクラスたんにんというたちばにあって、ないしんかんりおよびしんがくしどうなどをこうへいにしなければならない。)": "그녀는 학급 담임이라는 입장에서, 내신 관리 및 진학 지도 등을 공평하게 해야 한다",


	"実際に事故が起こるに至って (じっさいにじこがおこるにいたって)": "실제로 사고가 일어나기에 이르러서",
	"死亡事件が発生するに至って (しぼうじけんがはっせいするにいたって)": "사망 사건이 발생하기에 이르러서",
	"皿やスプーンにいたるまで (さらやスプーンにいたるまで)": "접시나 스푼에 이르기까지",
	"ことここにいたっては (ことここにいたっては)": "일이 이 지경에 이르러서는",
	"単に決定に至るプロセスの問題点 (たんにけっていにいたるプロセスのもんだいてん)": "단지 결정에 이르는 과정의 문제점",
	"路線を廃止するに至った経緯 (ろせんをはいしするにいたったけいい)": "노선을 폐지하게 이른 경위",
	"実感できるまでに至らない企業もまだ多い (じっかんできるまでにいたらないきぎょうもまだおおい)": "실감할 수 있기까지에 이르지 않은 기업도 아직 많다",
	"ことここにいたっては、未経験の僕にはどうすることもできない。 (ことここにいたっては、みけいけんのぼくにはどうすることもできない。)": "일이 이 지경에 이르러서는, 경험이 없는 나로서는 어떻게 할 수도 없다",
	"最近の店は、食料品から雑貨・化粧品にいたるまで、手広く扱っているところが多い。 (さいきんのみせは、しょくりょうひんからざっか・けしょうひんにいたるまで、てびろくあつかっているところがおおい。)": "요즘의 가게는, 식료품에서 잡화·화장품에 이르기까지 폭넓게 취급하고 있는 곳이 많다",


	"あの人にしてそうなのだから (あのひとにしてそうなのだから)": "그 사람이라도 그러하니까",
	"あの優秀な田中さんにして (あのゆうしゅうなたなかさんにして)": "그 우수한 다나카 씨라도",
	"一日にしてはできない (いちにちにしてはできない)": "하루에는 불가능하다",
	"6枚目にして最後となるCD (ろくまいめにしてさいごとなるCD)": "6장째로 마지막이 되는 CD",
	"専門家にして初めて書ける (せんもんかにしてはじめてかける)": "전문가가 되어서야 비로소 쓸 수 있다",
	"わずか27歳にして市長となった (わずかにじゅうななさいにしてしちょうとなった)": "불과 27세에 시장이 되었다",
	"ベテランの彼にしてこんな失敗をするのだから、素人の山田君が失敗するのも仕方がない。 (ベテランのかれにしてこんなしっぱいをするのだから、しろうとのやまだくんがしっぱいするのもしかたがない。)": "베테랑인 그 사람이라도 이런 실수를 하니까, 초보인 야마다 군이 실수하는 것도 어쩔 수 없다",
	"田中さんは40歳にしてようやく結婚相手を見つけた。 (たなかさんはよんじゅっさいにしてようやくけっこんあいてをみつけた。)": "다나카 씨는 40세에 겨우 결혼 상대를 찾았다",

}

nihongo_4 = {

	"聞くにたえない言葉 (きくにたえないことば)": "차마 들을 수 없는 말",
	"ご配慮をたまわり感謝にたえません (ごはいりょをたまわりかんしゃにたえません)": "배려를 해 주셔서 너무나도 감사합니다",
	"鑑賞にたえる作品 (かんしょうにたえるさくひん)": "감상할 만한 작품",
	"大人の鑑賞にたえるようなアニメ映画 (おとなのかんしょうにたえるようなアニメえいが)": "어른이 감상할 만한 애니메이션 영화",
	"有名な作家の講演会に行ったところ、あまりに聞くにたえない内容でがっかりした。 (ゆうめいなさっかのこうえんかいにいったところ、あまりにきくにたえないないようでがっかりした。)": "유명한 작가의 강연회에 갔다가, 너무나도 차마 들을 수 없는 내용이라 실망했다",
	"彼女の演奏は、アマチュアながら鑑賞にたえるようなものだった。 (かのじょのえんそうは、アマチュアながらかんしょうにたえるようなものだった。)": "그녀의 연주는 아마추어이면서도 감상할 만한 연주였다",


	"弟が社交的なタイプなのにひきかえ(おとうとがしゃこうてきなタイプなのにひきかえ)": "남동생이 사교적인 타입인 것과는 반대로",
	"いつも冷静でしっかり者の兄にひきかえ (いつもれいせいでしっかりもののあににひきかえ)": "항상 냉정하고 야무진 형과는 달리",
	"品物とひきかえに (しなものとひきかえに)": "물건과 바꿔",
	"人質の生命とひきかえに (ひとじちのせいめいとひきかえに)": "인질의 생명과 교환으로",
	"便利さとひきかえに失ったものも (べんりさとひきかえにうしなったものも)": "편리함과 바꿔 잃어버린 것도",
	"優秀な成績で大学を卒業した兄にひきかえ、弟は遊んでばかりだ。 (ゆうしゅうなせいせきでだいがくをそつぎょうしたあににひきかえ、おとうとはあそんでばかりだ。)": "우수한 성적으로 대학을 졸업한 형과는 달리, 남동생은 놀기만 한다",
	"男は人質とひきかえに3000万円を要求した。 (おとこはひとじちとひきかえにさんぜんまんえんをようきゅうした。)": "남자는 인질과 교환으로 3천만 엔을 요구했다",


	"君のいいようにすればいい (きみのいいようにすればいい)": "자네가 좋을 대로 하면 돼",
	"いちいち取り上げればきりがない (いちいちとりあげればきりがない)": "하나하나 거론하면 끝이 없다",
	"適当に答えておけばいいんだよ (てきとうにこたえておけばいいんだよ)": "적당히 대답해 두면 되는 거야",
	"洗剤をたくさん入れればいい (せんざいをたくさんいれればいい)": "세제를 많이 넣으면 된다",
	"ただ長く眠ればいい (ただながくねむればいい)": "그냥 오래 자면 된다",
	"夜中に騒いじゃいけないという法律はないよ。 (よなかにさわいじゃいけないというほうりつはないよ。)": "한밤중에 소란을 피워서는 안 된다는 법은 없어",
	"あのね、法律違反でなければいいってもんじゃないだろ。 (あのね、ほうりついはんでなければいいってもんじゃないだろ。)": "저기 말야, 법률 위반이 아니면 괜찮다는 말이 아니잖아",
	"彼はいつも仕事が雑だ。間違いをあげればきりがない。 (かれはいつもしごとがざつだ。まちがいをあげればきりがない。)": "그는 항상 일이 엉성하다. 실수를 열거하면 끝이 없다",


	"子どものためを思えばこそ (こどものためをおもえばこそ)": "자식을 위한 마음이기 때문에",
	"君の将来を考えればこそなんだよ (きみのしょうらいをかんがえればこそなんだよ)": "네 장래를 생각하기에 그런 거야",
	"貴社のご協力があればこそです (きしゃのごきょうりょくがあればこそです)": "귀사의 협력이 있기 때문입니다",
	"好きだという気持ちがあればこそ強くなれるのだ (すきだというきもちがあればこそつよくなれるのだ)": "좋아한다는 마음이 있기에 강해질 수 있는 것이다",
	"私のことを思えばこそだった (わたしのことをおもえばこそだった)": "나를 생각하기에 그런 것이었다",
	"私が仕事を続けられるのも、近くに子どもの世話をしてくれる人がいればこそだ。 (わたしがしごとをつづけられるのも、ちかくにこどものせわをしてくれるひとがいればこそだ。)": "내가 일을 계속할 수 있는 것도 근처에 아이를 돌봐 주는 사람이 있기 때문이다",


	"ウイルスの感染経路を明らかにすべく (ウイルスのかんせんけいろをあきらかにすべく)": "바이러스의 감염 경로를 밝히기 위해",
	"締め切りに間に合わせるべく (しめきりにまにあわせるべく)": "마감에 맞추기 위해",
	"友人を見舞うべく (ゆうじんをみまうべく)": "친구를 병문안하기 위해",
	"美術を学ぶべく (びじゅつをまなぶべく)": "미술을 배우고자",
	"急いで帰るべく業務をこなしていても (いそいでかえるべくぎょうむをこなしていても)": "서둘러 돌아가기 위해 업무를 처리해도",
	"地球環境を守るべく (ちきゅうかんきょうをまもるべく)": "지구환경을 지키기 위해",
	"山田さんは、借金を返すべく昼となく夜となく働いている。 (やまださんは、しゃっきんをかえすべくひるとなくよるとなくはたらいている。)": "야마다 씨는 빚을 갚기 위해 밤낮없이 일하고 있다",


	"人としてあるまじき残酷な行為だ (ひととしてあるまじきざんこくなこういだ)": "사람으로서 있을 수 없는 잔혹한 행위다",
	"医者としてあるまじきことだ (いしゃとしてあるまじきことだ)": "의사로서 있어서는 안 될 일이다",
	"学生として取るまじき態度 (がくせいとしてとるまじきたいど)": "학생으로서 취해서는 안 될 태도",
	"教育現場の長としてあるまじき行為 (きょういくげんばのちょうとしてあるまじきこうい)": "교육 현장의 수장으로서 있을 수 없는 행위",
	"幼い小学生を何人も殺すとは、人間にあるまじき行為だ。 (おさないしょうがくせいをなんにんもころすとは、にんげんにあるまじきこういだ。)": "어린 초등학생을 몇 명이나 죽이다니, 인간에게 있을 수 없는 행위다",


	"見事なまでに色づいた紅葉 (みごとなまでにいろづいたこうよう)": "멋질 정도로 물든 단풍",
	"簡単な作文は読めるまでになった (かんたんなさくぶんはよめるまでになった)": "간단한 작문은 읽을 수 있을 정도가 되었다",
	"その確かな表現力で見事なまでに演じきった (そのたしかなひょうげんりょくでみごとなまでにえんじきった)": "그 명확한 표현력으로 훌륭하게 연기했다",
	"支店長を任されるまでになったが (してんちょうをまかされるまでになったが)": "지점장을 맡을 정도가 되었지만",
	"我が社が取り扱っている革製品は、完璧なまでに魅力的なデザインを備えている。 (わがしゃがとりあつかっているかくせいひんは、かんぺきなまでにみりょくてきなデザインをそなえている。)": "우리 회사가 취급하고 있는 가죽제품은, 완벽할 정도로 매력적인 디자인을 갖추고 있다",
	"10年ほど経ってようやく現場監督を任されるまでになった矢先に、家庭の事情で退職せざるを得なかった。 (じゅうねんほどたってようやくげんばかんとくをまかされるまでになったやさきに、かていのじじょうでたいしょくせざるをえなかった。)": "10년 정도 지나 겨우 현장감독을 맡을 정도가 되었는데, 가정 사정으로 퇴직하지 않을 수 없었다",


	"担当者は休日出勤までして (たんとうしゃはきゅうじつしゅっきんまでして)": "담당자는 휴일 출근까지 해서",
	"環境破壊までして (かんきょうはかいまでして)": "환경 파괴까지 해서",
	"景観を犠牲にしてまで (けいかんをぎせいにしてまで)": "경관을 희생하면서까지",
	"借金してまで遊びに行く (しゃっきんしてまであそびにいく)": "빚을 지면서까지 놀러 가다",
	"家庭を犠牲にしてまでとなると (かていをぎせいにしてまでとなると)": "가정을 희생하면서까지가 되면",
	"子供の遊ぶ時間を奪ってまで (こどものあそぶじかんをうばってまで)": "아이의 놀 시간을 빼앗으면서까지",
	"いずれにせよ、盗作までして賞を取ろうとする神経は理解できない。 (いずれにせよ、とうさくまでしてしょうをとろうとするしんけいはりかいできない。)": "어쨌든, 표절까지 해서 상을 받으려는 마음은 이해할 수 없다",
	"環境破壊をしてまで工業化をおし進めていくのには疑問がある。 (かんきょうはかいをしてまでこうぎょうかをおしすすめていくのにはぎもんがある。)": "환경을 파괴하면서까지 공업화를 밀고 나가는 것에는 의문이 있다",


	"わざわざあなたに説明してもらうまでもない (わざわざあなたにせつめいしてもらうまでもない)": "일부러 당신에게 설명을 들을 것까지도 없다",
	"彼が喜んだのは言うまでもない (かれがよろこんだのはいうまでもない)": "그가 기뻐한 것은 말할 필요도 없다",
	"今さら弁解するまでもない (いまさらべんかいするまでもない)": "이제 와서 변명할 필요도 없다",
	"最悪とまでではないが (さいあくとまでではないが)": "최악이라고까지는 할 수 없지만",
	"会社を辞めろとまでは言わないが (かいしゃをやめろとまではいわないが)": "회사를 그만두라고까지는 말하지 않지만",
	"戦争がどんなに恐ろしい結果をもたらすか、今さら言うまでもない。 (せんそうがどんなにおそろしいけっかをもたらすか、いまさらいうまでもない。)": "전쟁이 얼마나 무서운 결과를 초래하는지, 새삼 말할 필요도 없다",
	"最高にうまいとまでは言わないが、値段を考えれば大満足だ。 (さいこうにうまいとまではいわないが、ねだんをかんがえればだいまんぞくだ。)": "최고로 맛있다고까지는 말할 수 없지만, 가격을 생각하면 대만족이다",


	"いいことずくめ": "좋은 일뿐",
	"ほこりだらけ": "먼지투성이",
	"あざだらけ": "멍투성이",
    
	"血まみれ (ちまみれ)": "피투성이",
	"汗まみれ (あせまみれ)": "땀투성이",
	"どろまみれになって働いても (どろまみれになってはたらいても)": "진흙투성이가 되어 일해도",
	"ほこりまみれになっている古い人形 (ほこりまみれになっているふるいにんぎょう)": "먼지투성이가 되어 있는 낡은 인형",
	"うちの弟は、自動車整備工場で毎日油まみれになって、働いている。 (うちのおとうとは、じどうしゃせいびこうじょうでまいにちあぶらまみれになって、はたらいている。)": "우리 남동생은 자동차 정비 공장에서 매일 기름투성이가 되어 일하고 있다",
  

}

nihongo_5 = {

	"もう二度と恋などするものか (もうにどとこいなどするものか)": "이제 두 번 다시 사랑 같은 거 하나 봐라",
	"どうしたものかと悩んでいる (どうしたものかとなやんでいる)": "어떻게 할 것인지 고민하고 있다",
	"謝ってきても許してやるもんか (あやまってきてもゆるしてやるもんか)": "사과해도 용서해 줄까 보냐",
	"もう少し良いものを使えないものかと思う (もうすこしよいものをつかえないものかとおもう)": "좀 더 좋은 것을 사용할 수 없는 것인가 생각한다",
	"こんなところであきらめるものか、絶対にやり遂げてやる。 (こんなところであきらめるものか、ぜったいにやりとげてやる。)": "이런 곳에서 포기할까 보냐, 반드시 해내고 말겠다",
	"そんな大事なことを誰がおまえなんかに頼むもんか。 (そんなだいじなことをだれがおまえなんかにたのむもんか)": "그런 중요한 일을 누가 너 같은 애한테 부탁할까 보냐",
	"どうしたものかと迷っている (どうしたものかとまよっている)": "어떻게 할지 망설이고 있다",
	"もう二度と行くものか (もうにどといくものか)": "이제 두 번 다시 가지도 않을 거야",

	"彼は『私が病気でもなったらどうしたものか。』と珍しく弱音を吐いた。 (かれは『わたしがびょうきでもなったらどうしたものか。』とめずらしくよわねをはいた。)": "그는 ‘내가 병이라도 나면 어떻게 한단지?’라고 드물게 무기력한 소리를 했다",
	"佐藤さんがどんなに足が速いからって、自動車より速く走れるものですか。 (さとうさんがどんなにあしがはやいからって、じどうしゃよりはやくはしれるものですか。)": "사토 씨가 아무리 발이 빠르다고 해도, 자동차보다 빨리 달릴 수 있겠습니까",


	"少年時代に戻れるものなら戻ってみたい (しょうねんじだいにもどれるものならもどってみたい)": "어린 시절로 돌아갈 수 있다면 돌아가 보고 싶다",
	"国に帰れるものなら帰りたい (くににかえれるものならかえりたい)": "고국에 돌아갈 수 있다면 돌아가고 싶다",
	"ちょっとでも間違いをしようものなら (ちょっとでもまちがいをしようものなら)": "조금이라도 실수라도 한다면",
	"昔は親に反抗しようものなら (むかしはおやにはんこうしようものなら)": "옛날엔 부모님께 반항하려고만 해도",
	"できるもんなら捕まえてごらん (できるもんならつかまえてごらん)": "잡을 수 있다면 잡아 봐라",
	"抜かずに済むものならそうしたい (ぬかずにすむものならそうしたい)": "빼지 않아도 된다면 그렇게 하고 싶다",
	"一緒に行けるものなら行ってあげたいが、仕事の都合上、そうもいかない。 (いっしょにいけるものならいってあげたいが、しごとのつごうじょう、そうもいかない。)": "같이 갈 수 있다면 가 주고 싶지만, 일의 형편상 그렇게도 안 된다",
	"掃除をさぼろうものなら、先生にしかられる。 (そうじをさぼろうものなら、せんせいにしかられる。)": "청소를 땡땡이치려 했다가는 선생님께 야단맞는다",


	"あの映画は一度見たものの (あのえいがはいちどみたものの)": "저 영화는 한 번 보기는 했지만",
	"行くと答えたものの (いくとこたえたものの)": "간다고 대답하긴 했지만",
	"就職はしたものの (しゅうしょくはしたものの)": "취직은 했지만",
	"能力は疑いようがないものの (のうりょくはうたがいようがないものの)": "능력은 의심할 수 없기는 하지만",
	"市民の心をつかもうとしたものの (しみんのこころをつかもうとしたものの)": "시민의 마음을 사로잡으려 하기는 했지만",
	"すぐ退院はできたものの、不幸にも後遺症が残り、思うように仕事をすることができなくなった。 (すぐたいいんはできたものの、ふこうにもこういしょうがのこり、おもうようにしごとをすることができなくなった。)": "금방 퇴원은 할 수 있었지만, 불행히도 후유증이 남아 생각대로 일을 할 수 없게 되었다",
	"軽い怪我だったらしいようなものの、大事故になっていたらと思うとこわい。 (かるいけがだったらしいようなものの、だいじこになっていたらとおもうとこわい。)": "가벼운 부상이었다고는 하지만, 큰 사고가 났더라면 하고 생각하니 무섭다",


	"ここへ来る前に電話をしておけばよかったものを (ここへくるまえにでんわをしておけばよかったものを)": "여기 오기 전에 전화를 해두었더라면 좋았을 텐데",
	"だれかに相談すれば簡単に解決できたものを (だれかにそうだんすればかんたんにかいけつできたものを)": "누군가와 의논했더라면 간단하게 해결되었을 것을",
	"もう少し早く病院に行けば助かったものを (もうすこしはやくびょういんにいけばたすかったものを)": "좀 더 빨리 병원에 갔더라면 살았을 텐데",
	"電話をくだされば車でお迎えにまいりましたものを (でんわをくださればくるまでおむかえにまいりましたものを)": "전화를 주셨더라면 차로 마중 나갔을 텐데",
	"素直に「ごめん」と謝ればいいものを (すなおに「ごめん」とあやまればいいものを)": "솔직하게 '미안해'라고 사과하면 될 텐데",
	"すぐに治療しておけばよかったものを (すぐにちりょうしておけばよかったものを)": "바로 치료해두었으면 좋았을 텐데",
	"対応がもっと早ければよかったものを、救助が遅れて被害が広がった。 (たいおうがもっとはやければよかったものを、きゅうじょがおくれてひがいがひろがった。)": "대응이 좀 더 빨랐더라면 좋았을 텐데, 구조가 늦어져 피해가 커졌다",


	"日本は島国ゆえに (にっぽんはしまぐにゆえに)": "일본은 섬나라(인 탓)에",
	"貧しいがゆえに (まずしいがゆえに)": "가난하기 때문에",
	"貧しさゆえに (まずしさゆえに)": "가난하기 때문에",
	"若きゆえの失敗 (わかきゆえのしっぱい)": "젊기 때문에 저지르는 실수",
	"有名人ゆえの悩み (ゆうめいじんゆえのなやみ)": "유명인이기 때문에 하는 고민",
	"それゆえに (それゆえに)": "그 때문에",

	"その手軽さゆえに人気を集めている (そのてがるさゆえににんきをあつめている)": "그 간편함 때문에 인기를 모으고 있다",
	"天才であるがゆえの苦悩 (てんさいであるがゆえのくのう)": "천재이기 때문에 겪는 고뇌",
	"父親が有名な水泳選手であるがゆえに (ちちおやがゆうめいなすいえいせんしゅであるがゆえに)": "아버지가 유명한 수영선수이기 때문에",
	"あまりにも正直で真面目すぎるがゆえに (あまりにもしょうじきでまじめすぎるがゆえに)": "너무나도 정직하고 지나치게 성실한 탓에",
	"女性であるがゆえにこんな差別を受けなければならないなんて、不公平だ。 (じょせいであるがゆえにこんなさべつをうけなければならないなんて、ふこうへいだ。)": "여성이기 때문에 이런 차별을 받아야 하다니, 불공평하다",
	"これもみな私の未熟さゆえのことです。 (これもみなわたしのみじゅくさゆえのことです。)": "이것도 모두 저의 미숙함 때문에 일어난 일입니다",


	"部品がなくては修理しようがない (ぶひんがなくてはしゅうりしようがない)": "부품이 없어서 수리할 수가 없다",
	"一人で全部集めようもない (ひとりでぜんぶあつめようもない)": "혼자서 전부 모을 수도 없다",
	"何とも言いようのない空気 (なんともいいようのないくうき)": "뭐라고 말할 수 없는 분위기",

	"増税は避けようのないもののようだ (ぞうぜいはさけようのないもののようだ)": "증세는 피할 수 없는 듯하다",
	"まさに奇跡としか言いようがない (まさにきせきとしかいいようがない)": "정말로 기적이라고밖에 말할 수 없다",
	"会社の成長など望みようもない (かいしゃのせいちょうなどのぞみようもない)": "회사의 성장 같은 것은 바랄 수도 없다",
	"これ以上きれいにしようがないくらい (これいじょうきれいにしようがないくらい)": "더 이상 깨끗하게 할 수 없을 정도로",
	"文句のつけようがないだけに (もんくのつけようがないだけに)": "흠잡을 수 없을 만큼 완벽하기에",

	"誰もがうらやむキャリアを持っているような人でも、言いようのない不安で苦しんでいることがある。 (だれもがうらやむきゃりあをもっているようなひとでも、いいようのないふあんでくるしんでいることがある。)": "누구나 부러워하는 경력을 가지고 있는 사람이라도, 말할 수 없는 불안감으로 괴로워할 때가 있다",
	"もっと早くから受験の対策を立てるべきだったのに、ことここに至ってはどうしようもない。 (もっとはやくからじゅけんのたいさくをたてるべきだったのに、ことここにいたってはどうしようもない。)": "좀 더 일찍부터 수험에 대한 대책을 세웠어야 했는데, 일이 이 지경에 이르러서는 어떻게 할 수도 없다",


	"私が遅れて行くわけにはいかない (わたしがおくれていくわけにはいかない)": "내가 늦게 갈 수는 없다",
	"あなた様にお見せするわけにはまいりません (あなたさまにおみせするわけにはまいりません)": "당신께 보여드릴 수는 없습니다",
	"会社を辞めるわけにもいかない (かいしゃをやめるわけにもいかない)": "회사를 그만둘 수도 없다",
	"社長の命令とあっては、従わないわけにはいかない (しゃちょうのめいれいとあっては、したがわないわけにはいかない)": "사장님의 명령이라면 따르지 않을 수는 없다",
	"待っていただくわけにはいきませんか (まっていただくわけにはいきませんか)": "기다려주실 수는 없습니까",
	"私としては見に行かないわけにはいかない (わたしとしてはみにいかないわけにはいかない)": "나로서는 보러 가지 않을 수는 없다",
	"途中でやめるわけにはいかない (とちゅうでやめるわけにはいかない)": "도중에 그만둘 수는 없다",
	"今更組織図から外すわけにもいかない (いまさらそしきずからはずすわけにもいかない)": "이제 와서 조직도에서 뺄 수도 없다",
	"ほうっておくわけにもいかず": "내버려둘 수도 없어서",

	"山田先生、今から原稿をいただきにあがってもよろしいでしょうか。(やまだせんせい、いまからげんこうをいただきにあがってもよろしいでしょうか。)": "야마다 선생님, 지금부터 원고를 받으러 방문해도 괜찮겠습니까?",
	"すみません、まだなんです。あと1週間待っていただくわけにはいきませんか。(すみません、まだなんです。あといっしゅうかんまっていただくわけにはいきませんか。)": "죄송합니다, 아직이에요. 앞으로 1주일 기다려주실 수는 없겠습니까?",
	"あまり付き合いのない親戚でも病気だと知らされれば、病院へお見舞いに行かないわけにはいきません。(あまりつきあいのないしんせきでもびょうきだとしらされれば、びょういんへおみまいにいかないわけにはいきません)": "그다지 교류가 없는 친척이라도 아프다는 소식을 들으면 병문안을 가지 않을 수는 없습니다",


	"世界中に衝撃をもって伝えられた (せかいじゅうにしょうげきをもってつたえられた)": "전 세계에 충격으로 전해졌다",
	"本日をもって終了する (ほんじつをもってしゅうりょうする)": "오늘로써 종료한다",
	"君の能力をもってすれば (きみののうりょくをもってすれば)": "자네의 능력이라면",

	"今年の3月31日をもって廃止された (ことしのさんがつさんじゅういちにちをもってはいしされた)": "올해 3월 31일로 폐지되었다",
	"来年2月のコンサートをもって解散するバンド (らいねんにがつのこんさーとをもってかいさんするばんど)": "내년 2월 콘서트로 해산하는 밴드",
	"そもそも何をもって幸せとするのだろうか (そもそもなにをもってしあわせとするのだろうか)": "애당초 무엇으로 행복이라고 하는 걸까",
	"私のノウハウをもってすれば (わたしののうはうをもってすれば)": "내 노하우로 한다면",
	"本年3月15日をもって閉館しました (ほんねんさんがつじゅうごにちをもってへいかんしました)": "올해 3월 15일로 폐관했습니다",
	"これをもってパーティーを終了させていただきます (これをもってぱーてぃーをしゅうりょうさせていただきます)": "이것으로 파티를 끝내겠습니다",
	"あなたの実力をもってすれば、どんなことでもやれると思うよ (あなたのじつりょくをもってすれば、どんなことでもやれるとおもうよ)": "당신 실력이라면 어떤 일이든 해낼 수 있을 거라 생각해",


	"予算不足のため、変更を余儀なくされた (よさんぶそくのため、へんこうをよぎなくされた)": "예산 부족으로 인해 어쩔 수 없이 변경하게 되었다",
	"多くの人が職場を離れることを余儀なくされている (おおくのひとがしょくばをはなれることをよぎなくされている)": "많은 사람들이 직장을 떠날 수밖에 없게 되어 있다",
	"敵に撤退を余儀なくさせた (てきにてったいをよぎなくさせた)": "적을 어쩔 수 없이 퇴각하게 했다",
	"さらには事業からの撤回を余儀なくされる (さらにはじぎょうからのてっかいをよぎなくされる)": "게다가 어쩔 수 없이 사업에서 철수하게 되다",

	"楽しみにしていた文化祭であるが、雨のため、中止を余儀なくされた (たのしみにしていたぶんかさいであるが、あめのため、ちゅうしをよぎなくされた)": "기대하고 있었던 문화제였지만, 비 때문에 어쩔 수 없이 중지하게 되었다",
	"干ばつは野菜の値上げを余儀なくさせた (かんばつはやさいのねあげをよぎなくさせた)": "가뭄은 어쩔 수 없이 채소 가격을 인상하게 했다",


	"ひかりは親の心配をよそに (ひかりはおやのしんぱいをよそに)": "히카리는 부모의 걱정을 아랑곳하지 않고",
	"あの子は教師の忠告をよそに (あのこはきょうしのちゅうこくをよそに)": "저 아이는 교사의 충고를 무시하고",

	"車内混雑をよそに作業に没頭していた (しゃないこんざつをよそにさぎょうにぼっとうしていた)": "차내 혼잡을 아랑곳하지 않고 작업에 몰두하고 있었다",
	"住民の不安をよそに、原子力発電所の建設はどんどん進められた (じゅうみんのふあんをよそに、げんしりょくはつでんしょのけんせつはどんどんすすめられた)": "주민의 불안을 아랑곳하지 않고, 원자력 발전소의 건설은 착착 진행되었다",
}

nihongo_6 = {


	"悩んだあげく (なやんだあげく)": "고심한 끝에",
	"さんざん迷ったあげく (さんざんまよったあげく)": "몹시 해맨 끝에",
	"口論のあげく (こうろんのあげく)": "언쟁 끝에",
	"2年の浪人のあげく (にねんのろうにんのあげく)": "2년의 재수 끝에",

	"あれこれ質問に答えさせられたあげく (あれこれしつもんにこたえさせられたあげく)": "이런저런 질문에 억지로 대답한 끝에",
	"2時間も待たされたあげく、翌日来てくれと言われた (にじかんもまたされたあげく、よくじつきてくれといわれた)": "2시간이나 기다린 끝에, 다음 날 와달라는 말을 들었다",


	"収入が減る一方で (しゅうにゅうがへるいっぽうで)": "수입이 줄어드는 한편으로",
	"子供を厳しくしかる一方で (こどもをきびしくしかるいっぽうで)": "자식을 엄하게 꾸짖는 한편으로",
	"失業率はあがる一方だ (しつぎょうりつはあがるいっぽうだ)": "실업률은 오르기만 한다",
	"借金は増える一方だ (しゃっきんはふえるいっぽうだ)": "빚은 늘어나기만 한다",

	"周囲の期待は高まる一方だ(しゅういのきたいはたかまるいっぽうだ)": "주위의 기대는 높아지기만 한다",
	"オンラインで売り上げが上がる一方で、店舗での売り上げは下がっている(おんらいんでうりあげがあがるいっぽうで、てんぽでのうりあげはさがっている)": "온라인에서 매상이 오르는 한편으로, 점포에서의 매상은 떨어지고 있다",
	"政府の施策もむなしく、失業者の数は増加する一方だ(せいふのしさくもむなしく、しつぎょうしゃのかずはぞうかするいっぽうだ)": "정부의 시책도 허무하게, 실업자의 수는 계속 늘기만 한다",


	"十分理解しうる(じゅうぶんりかいしうる)": "충분히 이해할 수 있는",
	"努力せずに成功することはありえない(どりょくせずにせいこうすることはありえない)": "노력하지 않고 성공하는 일은 있을 수 없다",
	"判定し得ない状況(はんていしえないじょうきょう)": "판정할 수 없는 상황",

	"正しい日本語になりえないのだと思う(ただしいにほんごになりえないのだとおもう)": "올바른 일본어가 될 수 없는 것이라고 생각한다",
	"君の今の成績なら、第一志望の大学に合格しうるだろう(きみのいまのせいせきなら、だいいちしぼうのだいがくにごうかくしうるだろう)": "자네의 지금 성적이라면, 제1지망 대학에 합격할 수 있을 거야",
	"新型コロナウイルス感染が否定し得ない場合は、駐車場での車中待合をお勧めします(しんがたころなういるすかんせんがひていしえないばあいは、ちゅうしゃじょうでのしゃちゅうまちあいをおすすめします)": "신형 코로나바이러스 감염을 부정할 수 없는 경우에는, 주차장에서의 차내 대기를 권장합니다",


	"手伝ってくれたおかげで(てつだってくれたおかげで)": "도와준 덕분에",
	"雑誌に店の名前が出たおかげで(ざっしにみせのなまえがでたおかげで)": "잡지에 가게 이름이 나온 덕분에",
	"助けてくれたおかげだ(たすけてくれたおかげだ)": "도와준 덕분이다",
	"応援してくれたみんなのおかげだ(おうえんしてくれたみんなのおかげだ)": "응원해 준 모두의 덕분이다",
	"先輩方の厳しくも暖かいサポートのおかげで(せんぱいがたのきびしくもあたたかいサポートのおかげで)": "선배님들의 엄하면서도 따뜻한 지원 덕분에",
	"うちの祖父は体が丈夫なおかげで、年を取っても医者の世話にならずに済んでいる(うちのそふはからだがじょうぶなおかげで、としをとってもいしゃのせわにならずにすんでいる)": "우리 할아버지는 몸이 튼튼한 덕분에, 나이가 들어도 의사의 도움을 받지 않고 지내고 있다",
	"私たちが幸福に暮らせるのも、みんなあの方のおかげです(わたしたちがこうふくにくらせるのも、みんなあのかたのおかげです)": "우리가 행복하게 살 수 있는 것도 모두 그분 덕분입니다",


	"大事故につながるおそれがある(だいじこにつながるおそれがある)": "대형 사고로 이어질 우려가 있다",
	"事故を起こすおそれがある(じこをおこすおそれがある)": "사고를 일으킬 우려가 있다",
	"倒産の恐れがある(とうさんのおそれがある)": "도산의 위험이 있다",

	"やる気を失わせてしまうおそれがある(やるきをうしなわせてしまうおそれがある)": "의욕을 잃게 할 우려가 있다",
	"不正にアクセスされる恐れがある(ふせいにアクセスされるおそれがある)": "불법으로 접속될 우려가 있다",
	"親鳥に気づかれるおそれがあることから、撮影チームはそれ以上近づくことを諦めた(おやどりにきづかれるおそれがあることから、さつえいチームはそれいじょうちかづくことをあきらめた)": "어미새가 눈치챌 우려가 있어서, 촬영팀은 더 이상 다가가는 것을 포기했다",


	"心臓がとまる思いをした(しんぞうがとまるおもいをした)": "심장이 멎는 기분이었다",
	"毎日いじめられていやな思いをした(まいにちいじめられていやなおもいをした)": "매일 괴롭힘 당해 싫은 마음이 들었다",
	"背筋が凍る思いだ(せすじがこおるおもいだ)": "등골이 오싹해지는 느낌이다",
	"人と関わる仕事がしたいという思いで(ひととかかわるしごとがしたいというおもいで)": "사람과 관련된 일을 하고 싶다는 마음으로",
	"その責任の重さに身が引き締まる思いです(そのせきにんのおもさにみがひきしまるおもいです)": "그 책임의 무게에 몸이 긴장되는 느낌입니다",
	"店員の失礼な態度に大変不快な思いをした(てんいんのしつれいなたいどにたいへんふかいなおもいをした)": "점원의 무례한 태도에 매우 불쾌한 기분이 들었다",
	"ぼくは手術の前には水が飲めなくて、大変つらい思いをした(ぼくはしゅじゅつのまえにはみずがのめなくて、たいへんつらいおもいをした)": "나는 수술 전에 물을 마실 수 없어서 아주 괴로운 심정이었다",
	"もう夫に会えないかと思うと、胸が詰まる思いです(もうおっとにあえないかとおもうと、むねがつまるおもいです)": "이제 남편을 만날 수 없다고 생각하니, 가슴이 메이는 느낌입니다",


	"できるかぎり(できるかぎり)": "가능한 한",
	"見渡すかぎり(みわたすかぎり)": "눈이 미치는 한, 눈에 들어오는 것 모두",
	"ストライキが続く限り(ストライキがつづくかぎり)": "파업이 계속되는 한",
	"私が調べた限りでは(わたしがしらべたかぎりでは)": "내가 조사한 바로는",
	"私の見るかぎりでは(わたしのみるかぎりでは)": "내가 보는 바로는",
	"何か対策を立てない限り(なにかたいさくをたてないかぎり)": "무언가 대책을 세우지 않는 한",
	"夜遅く一人で歩かないかぎりは(よるおそくひとりであるかないかぎりは)": "밤 늦게 혼자서 걷지 않는 한",

	"定年後も働けるかぎり働きたい(ていねんごもはたらけるかぎりはたらきたい)": "정년 후에도 일할 수 있는 한 일하고 싶다",
	"応援してくれるファンが一人でもいる限り(おうえんしてくれるファンがひとりでもいるかぎり)": "응원해주는 팬이 한 명이라도 있는 한",
	"応援してくれるファンの皆さんがいる限り(おうえんしてくれるファンのみなさんがいるかぎり)": "응원해주는 팬 여러분이 있는 한",
	"私が知る限りではこれまでになかった(わたしがしるかぎりではこれまでになかった)": "내가 아는 바로는 지금까지는 없었다",
	"私の知る限り、石原社長は絶対そんなことをするような人ではありません(わたしのしるかぎり、いしはらしゃちょうはぜったいそんなことをするようなひとではありません)": "내가 아는 한, 이시하라 사장은 절대 그런 일을 할 만한 사람이 아닙니다",
	"朝早くから営業している店は、私の調べた限りではここしかなかった(あさはやくからえいぎょうしているみせは、わたしのしらべたかぎりではここしかなかった)": "아침 일찍부터 영업하고 있는 가게는, 내가 조사한 바로는 여기밖에 없었다",
	"この契約は、2年後にどちらかが契約の取り消しを申し出ない限り、自動的に継続になります(このけいやくは、にねんごにどちらかがけいやくのとりけしをもうしでないかぎり、じどうてきにけいぞくになります)": "이 계약은, 2년 후에 어느 한 쪽이 계약 취소를 신청하지 않는 한, 자동적으로 계속됩니다",


	"休みがちだ(やすみがちだ)": "자주 쉰다",
	"忘れがちになる(わすれがちになる)": "자주 잊게 된다",
	"曇りがちの天気(くもりがちのてんき)": "자주 흐린 날씨",
	"子どもにありがちな病気(こどもにありがちなびょうき)": "어린이에게 흔히 있는 병",

	"短期的な成果が重視されがちな時代(たんきてきなせいかがじゅうしされがちなじだい)": "단기적인 성과가 중시되기 쉬운 시대",
	"野菜不足になりがちなだけに(やさいぶそくになりがちなだけに)": "채소가 부족해지기 쉬운 만큼",
	"堅苦しいものと思われがちだ(かたくるしいものとおもわれがちだ)": "딱딱하다고 여겨지기 십상이지만",
	"若い人は経験に乏しいので、とかく現実離れにした考えをいだきがちだ(わかいひとはけいけんにとぼしいので、とかくげんじつばなれにしたかんがえをいだきがちだ)": "젊은 사람은 경험이 부족하기 때문에, 자칫 현실과 동떨어진 생각을 품기 쉽다",
	"このところ、曇りがちの天気で洗濯物が干せなくて困る(このところ、くもりがちのてんきでせんたくものがほせなくてこまる)": "요즘 흐린 날씨가 많아서, 빨래를 말릴 수 없어 곤란하다",


	"一人暮らしの老人の自殺率が高いかというと(ひとりぐらしのろうじんのじさつりつがたかいかというと)": "독거 노인의 자살률이 높으냐 하면",
	"困ったかといえばそれほどでもなかった(こまったかといえばそれほどでもなかった)": "곤란했냐 하면 그 정도는 아니었다",
	"何かというと・何かといえば(なにかというと・なにかといえば)": "특하면, 입만 벌리면, 기회만 있으면",
	"どちらかというと・どちらかといえば": "어느 쪽이냐 하면",

	"母親でなくてはならないかというと(ははおやでなくてはならないかというと)": "어머니가 아니면 안 되느냐 하면",
	"初めから宇宙飛行士になるつもりだったかっていうと(はじめからうちゅうひこうしになるつもりだったかっていうと)": "처음부터 우주비행사가 될 생각이었냐 하면",
	"多くとったからといって、より丈夫になるかというと(おおくとったからといって、よりじょうぶになるかというと)": "많이 섭취했다고 해서 더 튼튼해지느냐 하면",
	"洗剤をたくさん入れればいいかといえば(せんざいをたくさんいれればいいかといえば)": "세제를 많이 넣으면 좋으냐 하면",
	"ただ長く眠ればいいかというとそうではない(ただながくねむればいいかというとそうではない)": "그저 오래 자면 되느냐 하면 그렇지 않다",
	"ドラマに出た名所だからといってみんなが見に行くかっていうと、そうでもない(どらまにでためいしょだからといってみんながみにいくかっていうと、そうでもない)": "드라마에 나온 명소라고 해서 모두가 보러 가느냐 하면, 꼭 그렇지는 않다",
	"計算結果から2100年の地球がどんな世界になるかといえば、海よりも陸上で気温が上がる(けいさんけっかからにせんひゃくねんのちきゅうがどんなせかいになるかといえば、うみよりもりくじょうできおんがあがる)": "계산 결과로는 2100년의 지구가 어떤 세계가 되느냐 하면, 바다보다 육상에서 기온이 올라간다",


	"駅の近くだから便利だろうと思ったら(えきのちかくだからべんりだろうとおもったら)": "역 근처라서 편리할 거라 생각했더니",
	"空が暗くなったと思うと(そらがくらくなったとおもうと)": "하늘이 어두워지자마자",
	"出かけたかと思えば(でかけたかとおもえば)": "외출했다 싶더니",

	"突然甘えてきたり、そうかと思えば、呼んでも無視して(とつぜんあまえてきたり、そうかとおもえば、よんでもむしして)": "갑자기 어리광을 부리거나, 그런가 했더니 불러도 무시하고",
	"ようやく着いたと思ったら(ようやくついたとおもったら)": "겨우 도착했나 했더니",
	"やっと仕事が終わったかと思ったら、またすぐ次の仕事が入ってきた(やっとしごとがおわったかとおもったら、またすぐつぎのしごとがはいってきた)": "겨우 일이 끝났나 했더니, 또 바로 다음 일이 들어왔다",
	"息子は学校から帰ってきたかと思うと、すぐに友だちの家に遊びに行った(むすこはがっこうからかえってきたかとおもうと、すぐにともだちのいえにあそびにいった)": "아들은 학교에서 돌아오자마자, 바로 친구 집에 놀러 갔다",
}

nihongo_7 = {


	"家に着くか着かないかのうちに(いえにつくかつかないかのうちに)": "집에 도착하자마자",
	"先生の講義が終わるか終わらないかのうちに(せんせいのこうぎがおわるかおわらないかのうちに)": "선생님의 강의가 끝나자마자",
	"幼稚園に入るか入らないかのころ(ようちえんにはいるかはいらないかのころ)": "유치원에 막 들어갔을 즈음",
	"私が３歳になったかならなかったかのころ(わたしがさんさいになったかなならなかったかのころ)": "내가 막 3살이 되었을 즈음",

	"小学校に入るか入らないかのころ(しょうがっこうにはいるかはいらないかのころ)": "초등학교에 막 들어갔을 즈음",
	"家に帰るなり、寝てしまった(いえにかえるなり、ねてしまった)": "집에 오자마자 자버렸다",

	"東京駅のホームに着くか着かないかのうちに新幹線は出発してしまった(とうきょうえきのほーむにつくかつかないかのうちにしんかんせんはしゅっぱつしてしまった)": "도쿄역 승강장에 도착하자마자 신칸센은 출발해버렸다",
	"初めて料理をしたのは、小学校に入るか入らないかのころだったと思います(はじめてりょうりをしたのは、しょうがっこうにはいるかはいらないかのころだったとおもいます)": "처음으로 요리를 한 것은 초등학교에 막 들어갔을 즈음이었다고 생각합니다",


	"私はどうも納得しかねる(わたしはどうもなっとくしかねる)": "나는 도무지 납득할 수 없다.",
	"私の一存では決めかねる(わたしのいちぞんではきめかねる)": "나 혼자만의 생각으로는 결정하기 어렵다.",
	"待ちかねる(まちかねる)": "더 기다릴 수 없다.",
	"見るに見かねて(みるにみかねて)": "보다 못해.",
	"事故を起こしかねない(じこをおこしかねない)": "사고를 일으킬지도 모른다.",
	"体をこわしかねない(からだをこわしかねない)": "건강을 해칠지도 모른다.",

	"ご使用後の返品対応はいたしかねます(ごしようごのへんぴんたいおうはいたしかねます)": "사용하신 후의 반품은 해드릴 수 없습니다.",
	"せっかくの伝統技術が失われかねない(せっかくのでんとうぎじゅつがうしなわれかねない)": "모처럼의 전통기술을 잃어버릴지도 모른다.",
	"『こんなはずではなかった』と言うことになりかねない(『こんなはずではなかった』ということになりかねない)": "‘이렇게 되는 게 아니었어’라고 말하게 될지도 모른다.",
	"うちの娘は大学に進学するか就職するか決めかねているらしい(うちのむすめはだいがくにしんがくするかしゅうしょくするかきめかねているらしい)": "우리 딸은 대학에 진학할지 취직할지 결정하기 어려운 것 같다.",
	"誤解を招きかねない表現を使わないように気をつけてください(ごかいをまねきかねないひょうげんをつかわないようにきをつけてください)": "오해를 살지도 모르는 표현은 쓰지 않도록 주의하세요.",


	"まるで夏になったかのようだ(まるでなつになったかのようだ)": "마치 여름이 된 것 같다.",
	"生きているかのようだ(いきているかのようだ)": "마치 살아 있는 것 같다.",
	"私が犯人であるかのような目で(わたしがはんにんであるかのようなめで)": "마치 내가 범인인 듯한 눈으로,",
	"全部分かっているかのように(ぜんぶわかっているかのように)": "전부 알고 있는 듯이",

	"どこか知らない町に来たかのような(どこかしらないまちにきたかのような)": "어딘지 모르는 동네에 온 듯한",
	"真夏に戻ったかのような日(まなつにもどったかのようなひ)": "한여름으로 돌아간 듯한 날",

	"日に焼けた黒い腕が競技会で優勝した勝利の印であるかのようだった(ひにやけたくろいうでがきょうぎかいでゆうしょうしたしょうりのしるしであるかのようだった)": "햇볕에 그을린 까만 팔이 경기대회에서 우승한 승리의 징표인 듯했다.",
	"山田さんはまるで自分の家を建てるかのように親身になって対応してくれた(やまださんはまるでじぶんのいえをたてるかのようにしんみになってたいおうしてくれた)": "야마다 씨는 마치 자기 집을 짓는 듯이 친절하게 응대해주었다.",


	"おとといから今日にかけて(おとといからきょうにかけて)": "그저께부터 오늘에 걸쳐,",
	"１丁目から３丁目にかけて(いっちょうめからさんちょうめにかけて)": "1가부터 3가에 걸쳐,",
	"９月から１０月にかけての時期(くがつからじゅうがつにかけてのじき)": "9월부터 10월에 걸친 시기,",
	"東京を訪れるなら、３月末から４月中ばにかけての時期をお勧めします(とうきょうをおとずれるなら、さんがつすえからしがつなかばにかけてのじきをおすすめします)": "도쿄를 방문한다면, 3월 말부터 4월 중반에 걸친 시기를 추천합니다.",


	"役柄から言って(やくがらからいって)": "직무로 보아,",
	"うちの経済状況から言って(うちのけいざいじょうきょうからいって)": "우리의 경제 상황에서 보건대,",
	"私の経験から言うと(わたしのけいけんからいうと)": "내 경험으로 보건대,",
	"私の立場から言わせてもらえば(わたしのたちばからいわせてもらえば)": "내 입장에서 보건대,",
	"営業の立場から言わせてもらえば(えいぎょうのたちばからいわせてもらえば)": "영업의 입장에서 보건대,",
	"この成績からいうと、東大はかなり無理だと思う(このせいせきからいうと、とうだいはかなりむりだとおもう)": "이 성적으로 보건대, 도쿄대는 상당히 무리라고 생각한다,",
	"「京都に行くんだけど、金閣寺と銀閣寺、どっちに行くか迷ってるんだ。」(きょうとにいくんだけど、きんかくじとぎんかくじ、どっちにいくかまよってるんだ)」": "교토에 갈 건데, 금각사와 은각사 중 어느 쪽으로 갈지 망설이고 있어.",
	"「どっちにも行ったことがある自分から言わせてもらえば、まず金閣寺は見逃せないですね。」(どっちにもいったことがあるじぶんからいわせてもらえば、まずきんかくじはみのがせないですね)」": "두 곳 모두 가본 적이 있는 제 입장에서 보건대, 우선 금각사는 놓칠 수 없죠.",


	"こちらこそ(こちらこそ)": "저야말로,",
	"今度こそ(こんどこそ)": "이번야말로,",
	"今までこそ(いままでこそ)": "과거는 어땠든 지금이야말로,",
	"私は映画が好きだからこそ(わたしはえいががすきだからこそ)": "나는 영화를 좋아하기 때문에,",
	"正直に話してくれたからこそ(しょうじきにはなしてくれたからこそ)": "솔직하게 말해주었기 때문에,",
	"危機に陥ってこそ(ききにおちいってこそ)": "위기에 직면해서야 비로소,",
	"ご両親の支えがあってこそだ(ごりょうしんのささえがあってこそだ)": "부모님의 뒷받침이 있기 때문에이다,",
	"この服はデザインこそ古いが(このふくはでざいんこそふるいが)": "이 옷은 디자인은 구식이지만,",
	"レポートは作成こそしたが(れぽーとはさくせいこそしたが)": "레포트는 작성은 했지만,",

	"優れた経験と志からこそだ(すぐれたけいけんとこころざしからこそだ)": "훌륭한 경험과 뜻이 있었기 때문에야말로 그렇다",
	"今こそ一流企業と言われる我が社だが(いまこそいちりゅうきぎょうといわれるわがしゃだが)": "지금은 일류기업이라 불리는 우리 회사지만",
	"優勝こそ逃したが(ゆうしょうこそのがしたが)": "우승은 놓쳤지만",
	"やはり実際に会ってこそ(やはりじっさいにあってこそ)": "역시 실제로 만나봐야 비로소",
	"積りこそしなかったが(つもりこそしなかったが)": "쌓이진 않았지만",

	"今でこそ、こうやって笑って話せるが、あの時は本当にどうしようかと思ったよ。 (いまこそ、こうやってわらってはなせるが、あのときはほんとうにどうしようかとおもったよ。)": "지금은 이렇게 웃으면서 말할 수 있지만, 그때는 정말로 어떻게 할까 생각했어.",
	"親というものは、子供が心配だからこそいろいろなことを聞いてしまうのだ。 (おやというものは、こどもがしんぱいだからこそいろいろなことをきいてしまうのだ。)": "부모라는 존재는, 자식이 걱정되기 때문에 이런저런 일을 묻는 것이다.",
	"生活費を自分で稼いでこそ、自立していると言えるだろう。 (せいかつひをじぶんでかせいでこそ、じりつしているといえるだろう。)": "생활비를 스스로 벌어야 비로소 자립한다고 말할 수 있을 것이다.",
	"佐藤君は年こそ若いが、与えられた仕事を効率よく時間通りにこなしている。 (さとうくんはとしこそわかいが、あたえられたしごとをこうりつよくじかんどおりにこなしている。)": "사토 군은 나이는 어리지만, 주어진 일을 효율적으로 제시간에 해내고 있다.",


	"彼の言い方からして気に入らない。 (かれのいいかたからしてきにいらない。)": "그 말투부터가 맘에 들지 않는다.",
	"その発想からして独特だ。 (そのはっそうからしてどくとくだ。)": "그 발상부터가 독특하다.",
	"母は症状からして彼女は病気に違いないと思った。 (はははしょうじょうからしてかのじょはびょうきにちがいないとおもった。)": "어머니는 증상으로 보아 그녀는 병이 틀림없다고 생각했다.",
	"この手紙は筆跡からして彼が書いたに違いない。 (このてがみはひっせきからしてかれがかいたにちがいない。)": "이 편지는 필적으로 보아 그가 쓴 것임에 틀림없다.",
	"彼に伝わっていないことからしておかしい。 (かれにつたわっていないことからしておかしい。)": "그에게 전해지지 않은 것부터가 이상하다.",
	"彼の性格からして最後までやり通すに違いない。 (かれのせいかくからしてさいごまでやりとおすにちがいない。)": "그의 성격으로 보아 끝까지 해낼 것임에 틀림없다.",
	"部長からして事態を把握していないのだから、平社員によくわからないのも無理はない。 (ぶちょうからしてじたいをはあくしていないのだから、ひらしゃいんによくわからないのもむりはない。)": "부장부터가 사태를 파악하고 있지 않으니까, 평사원이 잘 모르는 것도 무리는 아니다.",
	"この手紙は筆跡からして彼が書いたに違いない。 (このてがみはひっせきからしてかれがかいたにちがいない。)": "이 편지는 필적으로 보아 그가 쓴 것임에 틀림없다.",


	"話し方からすると (はなしかたからすると)": "말투로 보아",
    "さっきの態度からすると (さっきのたいどからすると)": "조금 전의 태도로 보아",
	"科学の観点からすれば (かがくのかんてんからすれば)": "과학의 관점으로 보자면",
	"私みたいな人間からすれば (わたしみたいなにんげんからすれば)": "나 같은 사람이 보면",
	"あの態度からすると、鈴木さんは引き下がる気はまったくないようだ。 (あのたいどからすると、すずきさんはひきさがるきはまったくないようだ。)": "저 태도로 보아, 스즈키 씨는 물러날 생각이 전혀 없는 것 같다.",
	"あの選手の実力からすれば、2メートル30というのは不可能な数字ではない。 (あのせんしゅのじつりょくからすれば、にめーとるさんじゅうというのはふかのうなすうじではない。)": "그 선수의 실력으로 보아, 2미터 30이라는 것은 불가능한 숫자가 아니다.",


	"しばらく連絡がないからといって (しばらくれんらくがないからといって)": "얼마간 연락이 없다고 해서",
	"説明を聞いたからといって (せつめいをきいたからといって)": "설명을 들었다고 해서",
	"試験に落ちたからって (しけんにおちたからって)": "시험에 떨어졌다고 해서",
	"雑誌で紹介されたからといって (ざっしでしょうかいされたからといって)": "잡지에서 소개되었다고 해서",
	"多くとったからといって (おおくとったからといって)": "많이 섭취했다고 해서",
	"見学したからって (けんがくしたからって)": "견학했다고 해서",
	"日本に住んでいるからといって、日本語が話せるとは限らない。 (にほんにすんでいるからといって、にほんごがはなせるとはかぎらない。)": "일본에 살고 있다고 해서, 일본어를 할 수 있다고는 할 수 없다.",
	"寂しいと言ったからって、旅の寂しさとか、ホームシックなんかとはまるで違う。 (さびしいといったからって、たびのさびしさとか、ほーむしっくなんかとはまるでちがう。)": "외롭다고 말했다고 해서, 여행의 외로움이나 향수 따위와는 전혀 다르다.",


	"この仕事を引き受けるからには (このしごとをひきうけるからには)": "이 일을 맡은 이상에는",
	"約束したからには (やくそくしたからには)": "약속한 이상에는",
	"お世話になった先生に頼まれた以上は (おせわになったせんせいにたのまれたいじょうは)": "신세진 선생님께 부탁받은 이상에는",
	"事態がこうなった上は (じたいがこうなったうえは)": "사태가 이렇게 된 바에는",

	"いったん仕事を引き受けたからには (いったんしごとをひきうけたからには)": "일단 일을 맡은 이상에는",
	"物事を始めてしまった以上 (ものごとをはじめてしまったいじょう)": "일을 시작해버린 이상",
	"それを知ったからには (それをしったからには)": "그것을 안 이상에는",
	"先生においでいただくからには (せんせいにおいでいただくからには)": "선생님이 와주시는 이상에는",
	"不正にアクセスされる恐れがある以上 (ふせいにあくせすされるおそれがあるいじょう)": "불법으로 접속될 우려가 있는 이상",

	"複数の人間が共同生活を営むからには、そこには秩序が必要である (ふくすうのにんげんがきょうどうせいかつをいとなむからには、そこにはちつじょがひつようである)": "다수의 인간이 공동생활을 영위하는 이상에는, 거기에는 질서가 필요하다",
	"夏目漱石の名言に『山が来てくれない以上は、自分が行くよりほかにしかたがあるまい』がある (なつめそうせきのめいげんに「やまがきてくれないいじょうは、じぶんがいくよりほかにしかたがあるまい」がある)": "나쓰메 소세키의 명언에 '산이 와주지 않는 이상에는, 자신이 갈 수밖에 없을 것이다'가 있다",
}

nihongo_8 = {


	"10年前に会ったきり、一度も会っていない (じゅうねんまえにあったきり、いちどもあっていない)": "10년 전에 만난 채, 한 번도 만나지 않았다",
	"電話が1回かかってきたきりだ (でんわがいっかいかかってきたきりだ)": "전화가 한 번 걸려 왔을 뿐이다",
	"あれっきり会わない (あれっきりあわない)": "그 후로 만나지 않는다",
	"それっきり何の連絡もない (それっきりなんのれんらくもない)": "그 후 아무 연락도 없다",

	"一度会ってそれっきりだ (いちどあってそれっきりだ)": "한 번 만나고 그것으로 끝이다",
	"娘は私の言葉に怒って出て行ったきり帰ってこない (むすめはわたしのことばにおこってでていったきりかえってこない)": "딸은 내 말에 화가 나서 나간 채 돌아오지 않는다",
	"たまった夏休みの宿題を済ませるため、息子はここ数日部屋にこもったきりです (たまったなつやすみのしゅくだいをすませるため、むすこはここすうじつへやにこもったきりです)": "밀린 여름방학 숙제를 끝마치기 위해, 아들은 요 며칠 방에 들어박혀 있을 뿐입니다",


	"一日で読みきった (いちにちでよみきった)": "하루 만에 다 읽었다",
	"二人で全部食べきれる (ふたりでぜんぶたべきれる)": "둘이서 전부 다 먹을 수 있다",
	"今日中には読みきれそうもない (きょうじゅうにはよみきれそうもない)": "오늘 안으로는 다 못 읽을 것 같다",
	"絶対、読みきれっこない (ぜったい、よみきれっこない)": "절대로 다 읽을 수 있을 리가 없다",
	"逆にすすぎ切れなかったりして (ぎゃくにすすぎきれなかったりして)": "반대로 완전히 헹굴 수 없거나 해서",
	"どんなに感謝してもきれない (どんなにかんしゃしてもきれない)": "아무리 감사드려도 다 할 수 없다",

	"それまでの教室数では対応しきれない (それまでのきょうしつすうではたいおうしきれない)": "지금까지의 교실수로는 다 대응할 수 없다",
	"一日では見きれないほどの作品 (いちにちではみきれないほどのさくひん)": "하루에는 다 볼 수 없을 정도의 작품",
	"バッテリーは充電前に使い切った方がいいって本当ですか (ばってりーはじゅうでんまえにつかいきったほうがいいってほんとうですか)": "배터리는 충전 전에 완전히 쓰는 게 좋다는 게 사실입니까?",
	"私の長所はどんな困難にもくじけず、与えられたことは最後までやり切れることです (わたしのちょうしょはどんなこんなんにもくじけず、あたえられたことはさいごまでやりきれることです)": "저의 장점은 어떤 어려움에도 좌절하지 않고, 주어진 일은 끝까지 해낼 수 있는 것입니다",
	"山本さんは押しが強いから、君には断り切れないかもしれないよ (やまもとさんはおしがつよいから、きみにはことわりきれないかもしれないよ)": "야마모토 씨는 억지가 세니까, 자네는 끝까지 거절할 수 없을지도 몰라",


	"息子は目が悪いくせに (むすこはめがわるいくせに)": "아들은 눈이 나쁜 주제에",
	"あまり食べられないくせに  (あまりたべられないくせに)": "별로 먹지도 못하면서도",
	"私を見るとすぐに逃げるくせに (わたしをみるとすぐににげるくせに)": "나를 보면 바로 도망치는 주제에",
	"本当は読んでみたくてしかたがないくせに (ほんとうはよんでみたくてしかたがないくせに)": "사실은 읽어보고 싶어서 어쩔 수 없는 주제에",
	"姉は食事のことで文句ばかり言っているくせに、自分では何も作らない (あねはしょくじのことでもんくばかりいっているくせに、じぶんではなにもつくらない)": "누나는 식사에 대해 불평만 하고 있으면서도, 자기는 아무것도 만들지 않는다",
	"ご本人がいちばん飲むのが好きなくせに、いつも人の逃げ口上を言う (ごほんにんがいちばんのむのがすきなくせに、いつもひとのにげこうじょうをいう)": "본인이 가장 마시는 것을 좋아하는 주제에, 항상 남의 핑계를 댄다",

	"そのパソコン、捨てるくらいなら (そのぱそこん、すてるくらいなら)": "그 컴퓨터, 버릴 거라면",
	"お金を借りてするくらいなら (おかねをかりてするくらいなら)": "돈을 빌려서 할 거라면",


	"コンビニのバイトは18歳ぐらいでないと (コンビニのバイトはじゅうはっさいぐらいでないと)": "편의점 아르바이트는 18세 정도가 아니면",
	"ニュースがわかるぐらいでないと授業についていけない (ニュースがわかるぐらいでないとじゅぎょうについていけない)": "뉴스를 이해할 정도가 아니면 수업을 따라갈 수 없다",
	"食事をするのも時間が惜しいくらいだ (しょくじをするのもじかんがおしいいくらいだ)": "식사할 시간조차 아까울 정도로",
	"せいぜい正しい持ち方ができるようになるぐらいだ (せいぜいただしいもちかたができるようになるぐらいだ)": "고작 올바르게 젓가락을 쥘 수 있게 될 정도이다",
	"一度断られたぐらいであきらめたりしないで (いちどことわられたぐらいであきらめたりしないで)": "한 번 거절당했다고 해서 포기하지 마",
	"昨日のパーティーには50人から60人ぐらいが出席していた (きのうのパーティーにはごじゅうにんからろくじゅうにんぐらいがしゅっせきしていた)": "어제 파티에는 50명에서 60명 정도가 참석했다",
	"あいつに議長を頼むぐらいなら会議を中止した方がましだ (あいつにぎちょうをたのむぐらいならかいぎをちゅうししたほうがましだ)": "그 녀석에게 의장을 맡기느니 회의를 중단하는 편이 낫다",
	"営業職などでは、「お客さんと雑談の一つもできるぐらいでないと1人前でない」と言うくらいだ (えいぎょうしょくなどでは、「おきゃくさんとざつだんのひとつもできるぐらいでないといちにんまえでない」というくらいだ)": "영업직에서는 '손님과 잡담 하나도 못 하면 한 사람 몫도 못 한다'고 할 정도다",


	"どんなに寂しいことか (どんなにさびしいことか)": "얼마나 쓸쓸했던가",
	"何度注意したことか (なんどちゅういしたことか)": "몇 번이나 주의를 줬던가",
	"きれいな景色だこと (きれいなけしきだこと)": "정말 멋진 경치야",
	"富士山の山頂から見た景色のなんと美しかったことか (ふじさんのさんちょうからみたけしきのなんとうつくしかったことか)": "후지산 정상에서 본 경치는 얼마나 아름다웠던가",
	"君には何度だまされ、裏切られたことか、もう許せない (きみにはなんどだまされ、うらぎられたことか、もうゆるせない)": "너한테는 몇 번이나 속고, 배신당했는지, 이제 용서할 수 없다",
	"15年も一緒に暮らした犬に死なれて、どんなに悲しかったことか (じゅうごねんもいっしょにくらしたいぬにしなれて、どんなにかなしかったことか)": "15년이나 같이 살았던 개가 죽어서, 얼마나 슬펐던가",


	"子供が少なくなってきていることから (こどもがすくなくなってきていることから)": "아이들이 줄어들고 있기 때문에",
	"昔から木が多かったところから (むかしからきがおおかったところから)": "옛날부터 나무가 많았기 때문에",
	"途中で降りることができないことから (とちゅうでおりることができないことから)": "도중에 내릴 수가 없기 때문에",
	"高齢者が著しく増加することから (こうれいしゃがいちじるしくぞうかすることから)": "고령자가 현저하게 증가하기 때문에",
	"腰の曲がった老人に似ているところから (こしのまがったろうじんににているところから)": "허리가 굽은 노인을 닮아서",
	"対応しきれなくなったことから (たいおうしきれなくなったことから)": "다 대응할 수 없게 되었기 때문에",
	"奈良公園は特に重要な歴史遺産が多いことから「歴史公園」とも言われている (ならこうえんはとくにじゅうようなれきしいさんがおおいことから「れきしこうえん」ともいわれている)": "나라공원은 특히 중요한 역사 유산이 많아서 '역사공원'이라고도 불리고 있다",
	"この球場は、大きな卵の形をしているところから、「ビッグ・エッグ」と呼ばれている (このきゅうじょうは、おおきなたまごのかたちをしているところから、「ビッグ・エッグ」とよばれている)": "이 구장은 커다란 달걀 모양을 하고 있기 때문에 '빅 에그'라고 불리고 있다",


	"そんな彼女のことだから (そんなかのじょのことだから)": "그런 그녀이니까",
	"まじめなあの人のことだから": "성실한 그 사람이니까",
	"まだ年も若いことだし (まだとしもわかいことだし)": "아직 나이도 어리니까",
	"梅雨も明けたことだし (つゆもあけたことだし)": "장마도 끝났고 하니까",
	"実力十分の彼女のことだから十中八九、合格するであろう (じつりょくじゅうぶんのかのじょのことだからじゅうちゅうはっく、ごうかくするであろう)": "실력이 충분한 그녀이니까 십중팔구 합격할 것이다",
	"天気もよいことだし、たまには童心に帰って魚でも捕まえに行こうかと思っています (てんきもよいことだし、たまにはどうしんにかえってさかなでもつかまえにいこうかとおもっています)": "날씨도 좋으니, 가끔은 동심으로 돌아가 물고기라도 잡으러 갈까 하고 생각하고 있습니다",


	"酒をやめることにした (さけをやめることにした)": "술을 끊기로 했다",
	"一応やったことにする (いちおうやったことにする)": "일단 한 것으로 하다",
	"これで終わることと致します (これでおわることといたします)": "이것으로 마치기로 하겠습니다",
	"あとで後悔することになる (あとでこうかいすることになる)": "나중에 후회하게 된다",
	"条件をクリアしたことにはならない (じょうけんをクリアしたことにはならない)": "조건을 충족한 것이 되지는 않는다",

	"次回、改めて検討することと致します (じかい、あらためてけんとうすることといたします)": "다음에 다시 검토하기로 하겠습니다",
	"ソファーを買うことにしたそうだ (そふぁーをかうことにしたそうだ)": "소파를 사기로 했다고 한다",
	"起こして注意することにした (おこしてちゅういすることにした)": "깨워서 주의를 주기로 했다",
	"見なかったことにしてほうっておく (みなかったことにしてほうっておく)": "못 본 것으로 하고 내버려두다",
	"今日のうちに戻すことにしていこう (きょうのうちにもどすことにしていこう)": "오늘 안에 되돌리는 것으로 해보자",
	"高校生になったんだから、もう漫画は読まないことにしようと思います (こうこうせいになったんだから、もうまんがはよまないことにしようとおもいます)": "고등학생이 되었으니까, 이제 만화책은 안 보기로 합니다",
	"会社には病気になったことにして、友だちと旅行に行った (かいしゃにはびょうきになったことにして、ともだちとりょこうにいった)": "회사에는 병이 난 것으로 하고 친구와 여행을 갔다",
	"山田さんの家族は来月福岡に引っ越すことになった (やまださんのかぞくはらいげつふくおかにひっこすことになった)": "야마다 씨의 가족은 다음달 후쿠오카로 이사하게 되었다",
	"５分本を読んだだけでは読書したことにはならない (ごふんほんをよんだだけではどくしょしたことにはならない)": "5분 책을 읽은 것만으로는 독서한 것이 되지는 않는다",


	"医者であることは医者なのですが (いしゃであることはいしゃなのですが)": "의사이기는 의사입니다만",
	"難しいことは難しいが (むずかしいことはむずかしいが)": "어렵기는 어렵지만",

	"ひと通り読むことは読んだが (ひととおりよむことはよんだが)": "대강 읽기는 읽었지만",
	"宿題で出された作文を書いたことは書いたが、まだ足りない所がある (しゅくだいでだされたさくぶんをかいたことはかいたが、まだたりないところがある)": "숙제로 내준 작문을 쓰긴 썼지만, 아직 부족한 점이 있다",
	"ピアノはひけることはひけますが、あまり上手ではありません (ぴあのはひけることはひけますが、あまりじょうずではありません)": "피아노는 칠 수 있기는 치지만, 그다지 잘하지는 못합니다",


	"雨がやみさえすれば (あめがやみさえすれば)": "비가 그치기만 하면",
	"だまってさえいれば (だまってさえいれば)": "잠자코만 있으면",
	"天気さえよければ (てんきさえよければ)": "날씨만 좋으면",
	"安くさえあれば (やすくさえあれば)": "싸기만 하면",
	"衣類は丈夫でさえあれば (いるいはじょうぶでさえあれば)": "옷은 질기기만 하면",
	"水やりを忘れさえしなければ (みずやりをわすれさえしなければ)": "물 주는 것만 잊지 않으면",
	"生きて帰ってきてくれさえすれば (いきてかえってきてくれさえすれば)": "살아서 돌아와 주기만 하면",
	"あなたが幸せでさえあれば、私はほかのことなどどうでもいい (あなたがしあわせでさえあれば、わたしはほかのことなどどうでもいい)": "당신이 행복하기만 하다면, 나는 다른 건 아무래도 좋아",
}

nihongo_9 = {


	"先生のご都合次第では (せんせいのごつごうしだいでは)": "선생님의 사정에 따라서라면",
	"頼み方次第では (たのみかたしだいでは)": "부탁하는 방식에 따라서라면",
	"検査の結果次第では (けんさのけっかしだいでは)": "검사 결과에 따라서는",
	"あとは本人次第だ (あとはほんにんしだいだ)": "나머지는 본인이 하기 나름이다",
	"私が代わりに来た次第です (わたしがかわりにきたしだいです)": "제가 대신 온 것입니다",
	"使う人の使い方次第で (つかうひとのつかいかたしだいで)": "쓰는 사람의 쓰는 방식에 따라",
	"復旧状況次第では (ふっきゅうじょうきょうしだいでは)": "복구 상황에 따라서는",
	"ご連絡した次第です (ごれんらくしたしだいです)": "연락드린 것입니다",
	"文明の利器である車も、運転次第でいくらでも走る凶器となりうる (ぶんめいのりきであるくるまも、うんてんしだいでいくらでもはしるきょうきとなりうる)": "문명의 이기인 자동차도, 운전하기 나름에 따라 흉기가 될 수도 있다",
	"現在、生活費と学費は全てアルバイトで賄っていて、奨学金を申請する次第です (げんざい、せいかつひとがくひはすべてあるばいとでまかなっていて、しょうがくきんをしんせいするしだいです)": "현재 생활비와 학비는 전부 아르바이트로 충당하고 있어, 장학금을 신청하는 것입니다",


	"ちょっと狭いんじゃない (ちょっとせまいんじゃない)": "좀 좁잖아",
	"外車が買えるじゃないか (がいしゃがかえるじゃないか)": "외제차를 살 수 있지 않은가",
	"君、困るじゃないか！ (きみ、こまるじゃないか！)": "자네, 곤란하지 않은가!",
	"デザートがただっていうだけじゃないか (でざーとがただっていうだけじゃないか)": "디저트가 공짜라는 것뿐이잖아",
	"けっこうよく書けてるじゃない (けっこうよくかけてるじゃない)": "제법 잘 썼네",
	"アイスクリームが食べたいのに、もうスーパーは閉まっているじゃないか (あいすくりーむがたべたいのに、もうすーぱーはしまっているじゃないか)": "아이스크림을 먹고 싶은데, 벌써 슈퍼마켓은 문을 닫았잖아",
	"その革のベルト、あなたのロングスカートにとても似合ってるじゃない (そのかわのべると、あなたのろんぐすかーとにとてもにあってるじゃない)": "그 가죽벨트, 너의 롱 스커트에 너무 잘 어울리네",


	"お金を払わずに済んだ (おかねをはらわずにすんだ)": "돈을 지불하지 않아도 되었다",
	"暑さにやられずにすんだ (あつさにやられずにすんだ)": "더위에 당하지 않고 끝났다",
	"抜かずに済むものならそうしたい (ぬかずにすむものならそうしたい)": "빠지지 않아도 된다면 그렇게 하고 싶다",
	"買えずにいたソファー (かえずにいたそふぁー)": "사지 못하고 있었던 소파",
	"その洋館を見ずに (そのようかんをみずに)": "그 양옥집을 보지 않고",
	"引っ越しの荷造りができずにいたところ(に) (ひっこしのにづくりができずにいたところ(に))": "이삿짐을 싸지 못하고 있었던 참에",
	"体調が悪い時は無理せずに家でゆっくり休んでください (たいちょうがわるいときはむりせずにいえでゆっくりやすんでください)": "컨디션이 안 좋을 때는 무리하지 말고 집에서 푹 쉬세요",
	"今年の夏は涼しかったので、エアコンを使わずにすんだ (ことしのなつはすずしかったので、えあこんをつかわずにすんだ)": "올 여름은 시원했기 때문에, 에어컨을 사용하지 않아도 되었다",


	"時間に間に合いそうにない (じかんに まにあいそうにない)": "시간에 맞추지 못할 것 같다",
	"達成できそうもない (たっせい できそうもない)": "달성할 수 없을 것 같다",
	"とてもできそうにもない (とても できそうにもない)": "도저히 못 할 것 같다",

	"間に合いそうになかったら (まにあいそうになかったら)": "시간에 맞추지 못할 것 같으면",
	"一度座ったら、立ち上がれそうにないぐらい (いちどすわったら、たちあがれそうにないぐらい)": "한 번 앉으면 못 일어날 것 같을 정도로",
	"全然勉強していなくて合格できそうにないから、今回の試験は受けないことにした (ぜんぜんべんきょうしていなくて ごうかくできそうにないから、こんかいのしけんは うけないことにした)": "공부를 하나도 안 해서 합격할 수 없을 것 같아서, 이번 시험은 보지 않기로 했다",
	"時間がぎりぎりで間に合いそうにもないので、先に行ってください (じかんがぎりぎりで まにあいそうにもないので、さきにいってください)": "시간이 빠듯해서 시간에 맞추지 못할 것 같으니, 먼저 가세요",


	"体に気をつけてとだけ伝えておいて (からだにきをつけてとだけつたえておいて)" : "몸 조심하라고만 전해줘",
	"材料をまぜて焼くだけだから (ざいりょうをまぜてやくだけだから)" : "재료를 섞어서 굽기만 하면 되니까",
	"精一杯やるだけです (せいいっぱいやるだけです)" : "힘껏 할 뿐입니다",
	"母は黙って聞くだけだった (はははだまってきくだけだった)" : "엄마는 묵묵히 들을 뿐이었다",
	"買うだけ無駄だったよ (かうだけむだだったよ)" : "사는 만큼 낭비였어",
	"ここのパンフレットは欲しいだけ持って行ってもかまいません (ここのぱんふれっとはほしいだけもっていってもかまいません)" : "이곳의 팸플릿은 원하는 만큼 가져가도 상관없습니다",
	"優勝は夢としてもせめて一回戦だけは勝ちたいと思う (ゆうしょうはゆめとしてもせめていっかいせんだけはかちたいとおもう)" : "우승은 꿈이라고 해도 적어도 1차전만은 이기고 싶다고 생각한다",
	"別に用事じゃないんだ。ちょっと声が聞きたかっただけだよ (べつにようじじゃないんだ。ちょっとこえがききたかっただけだよ)" : "딱히 볼일이 있는 게 아니야. 목소리를 좀 듣고 싶었을 뿐이야",


	"泣いたって無駄だ (ないたってむだだ)" : "울어도 소용없다",
	"今さら言ったってもう遅い (いまさらいったってもうおそい)" : "이제 와서 말해봤자 이미 늦다",
	"いくら親しくたって (いくらしたしくたって)" : "아무리 친하더라도",
	"高いったって５万円はしないよ (たかいったってごまんえんはしないよ)" : "비싸봤자 5만 엔은 안 할 거야",
	"逃げようたってだめだぞ (にげようたってだめだぞ)" : "도망가려고 해도 소용없어",
	"買うたって近くに店はないよ (こうたってちかくにみせはないよ)" : "산다 해도 근처에 가게는 없어",
	"1日だって休んだことはない (いちにちだってやすんだことはない)" : "하루도 쉰 적은 없다",
	"僕だって困るよ (ぼくだってこまるよ)" : "나도 또한 곤란해",
	"彼女、結婚したんだって (かのじょ、けっこんしたんだって)" : "그 여자, 결혼했대",
	"いくら飲んだって大丈夫だ (いくらのんだってだいじょうぶだ)" : "아무리 마셔도 괜찮다",

	"そんなこと、どうだってかまわない (そんなこと、どうだってかまわない)" : "그런 건 어찌되든 상관없다",
	"探すったって、どうやって探すの？ (さがすったって、どうやってさがすの？)" : "찾는다고 해도 어떻게 찾아?",
	"去年優勝してるんだって (きょねんゆうしょうしてるんだって)" : "작년에 우승했대",
	"ピアスだって、たまたま落とさない日々 (ぴあすだって、たまたまおとさないひび)" : "피어스도 가끔 잃어버리지 않는 날들",
	"あなたが来たって来なくたって、かまいやしないよ (あなたがきたってこなくたって、かまいやしないよ)" : "당신이 오든 안 오든 상관하지 않아",
	"「このキーホルダーはいくらでしょうか。」 (このきーほるだーはいくらでしょうか)" : "이 키홀더는 얼마일까요?",
	"「値段が高いったってせいぜい1,000円でしょう。」 (ねだんがたかいったってせいぜいせんえんでしょう)" : "가격이 비싸다고 해도 기껏해야 천 엔이겠죠",
	"彼の家の庭にはプールだってあります (かれのいえのにわにはぷーるだってあります)" : "그의 집 정원에는 수영장도 있습니다",
	"先生は昼過ぎに来るんだって (せんせいはひるすぎにくるんだって)" : "선생님은 점심 시간 지나서 온대",


	"急いだところで (いそいだところで)" : "아무리 서둘러 봤자",
	"いくら後悔したところで (いくらこうかいしたところで)" : "아무리 후회한들",
	"どちらにしたところで (どちらにしたところで)" : "어느 쪽이라고 한들",
	"大金持ちにしたところで (おおがねもちにしたところで)" : "대부호라고 한들",
	"全員が参加するとしたところで (ぜんいんがさんかするとしたところで)" : "전원이 참가해 봤자",
	"旅行に行くとしたって (りょこうにいくとしたって)" : "여행을 간다고 한들",
	"この問題にしたって (このもんだいにしたって)" : "이 문제라고 한들",

	"いくら働いたところで、こう物価が高くては生活は楽にならない (いくらはたらいたところで、こうぶっかがたかくてはせいかつはらくにならない)" : "아무리 일해 봤자, 이렇게 물가가 비싸서는 생활은 편해지지 않는다",
	"いつまでも先輩ばかり頼るわけにはいかない。田中先輩にしたところで、この先ずっと日本にいるわけではないのだから (いつまでもせんぱいばかりたよるわけにはいかない。たなかせんぱいにしたところで、このさきずっとにほんにいるわけではないのだから)" : "언제까지나 선배만 의지할 수는 없다. 다나카 선배라고 한들 앞으로 쭉 일본에 있는 것은 아니니까",


	"手紙を見たとたん (てがみをみたとたん)" : "편지를 본 순간",
	"暑くなったとたん (あつくなったとたん)" : "더워지자마자",
	"窓を開けたとたんに (まどをあけたとたんに)" : "창문을 연 순간에",
	"家を出たとたんに (いえをでたとたんに)" : "집을 나서자마자",
	"車から出ようとしたとたんに (くるまからでようとしたとたんに)" : "차에서 나오려고 한 순간에",
	"小学校に入学したとたん (しょうがっこうににゅうがくしたとたん)" : "초등학교에 입학하자마자",
	"家を出ようとしたとたんに、雨が激しく降り出した (いえをでようとしたとたんに、あめがはげしくふりだした)" : "집을 나서려는 순간, 비가 세차게 내리기 시작했다",


	"アルバイトをしたり勉強をしたりで (あるばいとをしたりべんきょうをしたりで)" : "아르바이트를 하거나 공부를 하거나 해서",
	"CDを聴いたり本を読んだりして (しーでぃーをきいたりほんをよんだりして)" : "CD를 듣거나 책을 읽거나 하면서",
	"車が故障したり財布を落としたりで (くるまがこしょうしたりさいふをおとしたりで)" : "차가 고장 나거나 지갑을 잃어버리거나 해서",
	"雨が降ったり降らなかったりだった (あめがふったりふらなかったりだった)" : "비가 오락가락했다",

	"逆にすぎ切れなかったりして (ぎゃくにすぎきれなかったりして)" : "반대로 잘 행글 수 없거나 해서",
	"来るって言ってても、来たっり来なかったりだから (くるっていってても、きたりこなかったりだから)" : "온다고 말해도 왔다 안 왔다 하니까",
	"残っていてもサイズが合うのがなかったりで (のこっていてもさいずがあうのがなかったりで)" : "남아 있어도 사이즈가 맞는 게 없거나 해서",
	"気温が高かったり低かったりで安定しない (きおんがたかかったりひくかったりであんていしない)" : "기온이 높거나 낮거나 해서 안정되지 않는다",
	"車が故障したり財布を落としたりと、さんざんな旅だった (くるまがこしょうしたりさいふをおとしたりと、さんざんなたびだった)" : "차가 고장나기도 하고 지갑을 잃어버리기도 해서, 몹시 힘든 여행이었다",


	"ほかの人は知りっこない (ほかのひとはしりっこない)" : "다른 사람이 알 리 없다",
	"いくら買ってもあたりっこない (いくらかってもあたりっこない)" : "아무리 사도 당첨될 리 없다",
	"恋人なんか出来っこない (こいびとなんかできっこない)" : "애인 따위 생길 리 없다",
	"読みきれっこないと思ったが (よみきれっこないとおもったが)" : "다 읽을 수 있을 리 없다고 생각했는데",
	"どうせ当選しっこないから、後で問題になることもないと思っていた (どうせとうせんしっこないから、あとでもんだいになることもないとおもっていた)" : "어차피 당선될 리 없으니, 나중에 문제가 될 일도 없다고 생각했었다",
	"60巻の漫画を一晩じゃどうしても読み切れっこないからあきらめた (ろくじゅっかんのまんがをひとばんじゃどうしてもよみきれっこないからあきらめた)" : "60권의 만화책을 하룻밤에 도저히 다 읽을 수 있을 리가 없어서 포기했다",
}

nihongo_10 = {


	"試供品だと注文したつもりが (しきょうひんだとちゅうもんしたつもりが)" : "샘플만 주문한 생각이었는데",
	"虫が平気なつもりでも (むしがへいきなつもりでも)" : "벌레가 아무렇지도 않다고 생각했어도",
	"自分では正しいつもりでも (じぶんではただしいつもりでも)" : "본인은 옳다고 생각해도",
	"自分では傷つけたつもりはなければ (じぶんではきずつけたつもりはなければ)" : "자기 입장에선 상처 준 생각은 없었지만",
	"だまされたつもりで飲んでみる (だまされたつもりでのんでみる)" : "속은 셈 치고 마셔 보다",
	"まだ若いつもりでいる (まだわかいつもりでいる)" : "아직 젊은 줄 알고 있다",
	"初めから宇宙飛行士になるつもりだった (はじめからうちゅうひこうしになるつもりだった)" : "처음부터 우주비행사가 될 생각이었다",
	"人よりも詳しく知っているつもりの私でも (ひとよりもくわしくしっているつもりのわたしでも)" : "다른 사람보다도 자세하게 알고 있다고 생각한 나도",
	"新入生が話しやすいようにしたつもりが、逆に… (しんにゅうせいがはなしやすいようにしたつもりが、ぎゃくに…)" : "신입생이 말하기 편하도록 하려던 생각이, 반대로…",
	"きちんと手を洗ったつもりでも (きちんとてをあらったつもりでも)" : "깨끗이 손을 씻었다고 생각해도",
	"私としては泣かせるつもりはなかった (わたしとしてはなかせるつもりはなかった)" : "나로서는 울릴 생각은 없었다",
	"海外を旅行したつもりになれる (かいがいをりょこうしたつもりになれる)" : "해외를 여행했다는 생각이 들 수 있다",

	"いつものように買い物したつもりが、予定よりも食費がかさんでしまった (いつものようにかいものしたつもりが、よていよりもしょくひがかさんでしまった)" : "평소처럼 쇼핑했다고 생각이 들었는데, 예정보다도 식비가 불어나 버렸다",
	"洗ったつもりのその手、本当にきれいだと思いますか (あらったつもりのそのて、ほんとうにきれいだとおもいますか)" : "씻었다고 생각하는 그 손, 정말로 깨끗하다고 생각합니까?",
	"志望する大学に向けて死んだつもりで勉強します (しぼうするだいがくにむけてしんだつもりでべんきょうします)" : "지망하는 대학을 목표로 죽은 셈치고 공부하겠습니다",
	"明日行くから、そのつもりでいてくれ (あしたいくから、そのつもりでいてくれ)" : "내일 갈 테니까 그런 줄 알고 있어 줘",


	"かつては緑であった田園 (ではみどりであったでんえん)" : "예전에는 초록이었던 논밭",
	"よほどひどいものでなければ (よほどひどいものでなければ)" : "어지간히 심한 것이 아니면",
	"日本を代表する作曲家でもない (にほんをだいひょうするさっきょくかでもない)" : "일본을 대표하는 작곡가도 아니다",

	"天才であるがゆえの苦悩 (てんさいであるがゆえのくのう)" : "천재이기 때문에 겪는 고뇌",
	"ところがである (ところがである)" : "그런데 말이다",
	"石川さんでないとすれば (いしかわさんでないとすれば)" : "이시카와 씨가 아니라면",
	"自然に囲まれたどかな所であるといえば (しぜんにかこまれたどかなところであるといえば)" : "자연에 둘러싸인 한가로운 곳이라고 한다면",
	"見当たらないようであるが (みあたらないようであるが)" : "발견되지 않는 것 같으나",
	"～にふさわしい女性になりたいと思ったのである (～にふさわしいじょせいになりたいとおもったのである)" : "～에 어울리는 여성이 되고 싶다고 생각했기 때문이다",
	"遠い未来からの使者のようでもある (とおいみらいからのししゃのようでもある)" : "먼 미래에서 온 사신 같기도 하다",
	"雪が降るんじゃないかというぐらい (ゆきがふるんじゃないかというぐらい)" : "눈이 오지 않을까 싶을 정도로",
	"論文というものは言葉で書くものである (ろんぶんというものはことばでかくものである)" : "논문이라는 것은 언어로 쓰는 것이다",
	"当たり前のことだが、これは肝心なことである (あたりまえのことだが、これはかんじんなことである)" : "당연한 말이지만, 이것은 매우 중요한 것이다",
	"よい文章を書くためには単語の選択に慎重でなければならないという (よいぶんしょうをかくためにはたんごのせんたくにしんちょうでなければならないという)" : "좋은 글을 쓰기 위해서는 단어 선택에 신중하지 않으면 안 된다고 한다",


	"奥さんが亡くなってからというもの (おくさんがなくなってからというもの)" : "부인이 죽고 나서 계속",
	"不景気になってからというもの (ふけいきになってからというもの)" : "불경기가 되고 나서 계속",
	"ここ３日というものろくに食べていない (ここみっかというものろくにたべていない)" : "요 3일 동안 제대로 먹지 않고 있다",
	"この１週間というもの、仕事どころではない (このいっしゅうかんというもの、しごとどころではない)" : "최근 일주일 동안 일할 상황이 아니다",

	"社会人になってからというもの (しゃかいじんになってからというもの)" : "사회인이 되고 나서 계속",
	"車を手に入れてからというもの、彼は毎週友だちを誘ってはドライブに出かけている (くるまをてにいれてからというもの、かれはまいしゅうともだちをさそってはどらいぶにでかけている)" : "차를 구입하고 나서 계속, 그는 매주 친구를 불러서는 드라이브를 가고 있다",
	"彼女はここ１か月というもの授業を休んでいる (かのじょはここいっかげつというものじゅぎょうをやすんでいる)" : "그녀는 요 한 달 동안 수업을 쉬고 있다",


	"問題点を指摘しようとしたにすぎず (もんだいてんをしてきしようとしたにすぎず)" : "문제점을 지적하려고 했던 것에 지나지 않으며",
	"世界のほんの小さな一部分でしかない (せかいのほんのちいさないちぶぶんでしかない)" : "세계의 그저 작은 일부분에 불과하다",
	"話題の本だから読んでみようかぐらいの気持ちでしかなかった (わだいのほんだからよんでみようかぐらいのきもちでしかなかった)" : "화제의 책이라 읽어볼까 정도의 기분에 지나지 않았다",
	"正当化するための口実にすぎまい (せいとうかするためのこうじつにすぎまい)" : "정당화하기 위한 구실에 지나지 않을 것이다",
	"池田さんとは会えば言葉を交わす程度の付き合いでしかない (いけださんとはあえばことばをかわすていどのつきあいでしかない)" : "이케다 씨와는 만나면 말을 주고받는 정도의 교제에 불과하다",
	"人の一生は一瞬の夢にすぎないという人もいるが、私は短くも長くもないと思う (ひとのいっしょうはいっしゅんのゆめにすぎないというひともいるが、わたしはみじかくもながくもないとおもう)" : "사람의 일생은 한순간의 꿈에 지나지 않는다는 사람도 있지만, 나는 짧지도 길지도 않다고 생각한다",


	"残念でならない (ざんねんでならない)" : "너무 유감스럽다",
	"恥ずかしくてたまらない (はずかしくてたまらない)" : "부끄러워서 견딜 수 없다",
	"うれしくてたまらない (うれしくてたまらない)" : "너무 기쁘다",
	"両親に会いたくてならない (りょうしんにあいたくてならない)" : "부모님을 너무 만나고 싶다",
	"心配でならない (しんぱいでならない)" : "너무 걱정스럽다",

	"大事な場面でのミスが悔やまれてならない (だいじなばめんでのみすがくやまれてならない)" : "중요한 상황에서의 실수가 후회되어 견딜 수 없다",
	"本当は読んでみたくてしかたがない (ほんとうはよんでみたくてしかたがない)" : "사실은 읽어보고 싶어서 견딜 수 없다",
	"鈴木さんは、嬉しくてたまらないかのような顔をしてみせた (すずきさんは、うれしくてたまらないかのようなかおをしてみせた)" : "스즈키 씨는 기뻐서 견딜 수 없는 듯한 표정을 지어 보였다",
	"中村さんは、試験の結果が気になってならないくせに、平然とした顔をしていた (なかむらさんは、しけんのけっかがきになってならないくせに、へいぜんとしたかおをしていた)" : "나카무라 씨는 시험 결과가 신경 써서 견딜 수 없는데도, 태연한 얼굴을 하고 있었다",


	"息子からの手紙を見ては泣く毎日だった (むすこからのてがみをみてはなくまいにちだった)" : "아들에게서 온 편지를 보고는 우는 하루하루였다",
	"あの子と一緒でなくては (あのこといっしょでなくては)" : "저 아이와 함께가 아니면",
	"ちぎっては投げ、ちぎっては投げ (ちぎってはなげ、ちぎってはなげ)" : "따서 던지고, 따서 던지고",
	"書いては消し、書いては消し (かいてはけし、かいてはけし)" : "쓰고 지우고, 쓰고 지우고",
	"他人に知られては困る情報は (たにんにしられてはこまるじょうほうは)" : "타인에게 알려져서는 곤란한 정보는",
	"デザイン画を描いては直すを繰り返す (でざいんがをかいてはなおすをくりかえす)" : "디자인 스케치를 그리고는 고치기를 반복하다",
	"人の手のみに頼っていては (ひとのてのみにたよっていては)" : "사람의 손에만 의지하고 있어서는",
	"つらいときに読み返しては (つらいときによみかえしては)" : "괴로울 때 다시 읽고는",
	"子どもの教育機会が奪われることがあってはならない (こどものきょういくきかいがうばわれることがあってはならない)" : "아이의 교육 기회가 박탈되는 일이 있어서는 안 된다",

	"うちの庭にあるこの木はこのまま育ってもらっては困るので、悩んでいる (うちのにわにあるこのきはこのままそだってもらってはこまるので、なやんでいる)" : "우리 정원에 있는 이 나무는 이대로 자라게 해서는 곤란하기 때문에, 고민하고 있다",
	"食っては寝、食っては寝で、夏の間に３キロも太った (くってはね、くってはねで、なつのあいだにさんきろもふとった)" : "먹고 자고 먹고 자고 해서, 여름 동안에 3킬로나 쪘다",


	"今年はもっと練習して、きっと優勝してみせよう (ことしはもっとれんしゅうして、きっとゆうしょうしてみせよう)" : "올해엔 더 연습해서 반드시 우승해 보이겠어",
	"この手術には絶対成功してみせる (このしゅじゅつにはぜったいせいこうしてみせる)" : "이 수술은 반드시 성공해 보이겠다",
	"どうせ試合に出るからには、必ず優勝してみせる (どうせしあいにでるからには、かならずゆうしょうしてみせる)" : "어차피 시합에 나가는 이상, 반드시 우승해 보이겠다",
	"今度はおいしく作ってみせる (こんどはおいしくつくってみせる)" : "이번에는 맛있게 만들어 보이겠다",
	"私はあのハンサムな男の人ときっと結婚してみせよう (わたしはあのはんさむなおとこのひとときっとけっこんしてみせよう)" : "나는 저 잘생긴 남자하고 반드시 결혼해 보이겠어",


	"悩んでばかりいる (なやんでばかりいる)" : "고민만 하고 있다",
	"ぜんぜん勉強しないで遊んでばかりいる (ぜんぜんべんきょうしないであそんでばかりいる)" : "공부는 전혀 안 하고 놀고만 있다",
	"悲しんでばかりはいられません (かなしんでばかりはいられません)" : "슬퍼하고만 있을 수는 없습니다",
	"待ってばかりはいられない (まってばかりはいられない)" : "기다리고만 있을 수는 없다",
	"落ち込んでばかりいても始まらない (おちこんでばかりいてもはじまらない)" : "우울해하고만 있어도 소용없다",
	"連休中どこにも出かけず、寝てばかりいたせいか (れんきゅうちゅうどこにもでかけず、ねてばかりいたせいか)" : "연휴 내내 아무 데도 나가지 않고 잠만 잤던 탓인지",
	"そんなずっと食べてばかりいると太るよ (そんなずっとたべてばかりいるとふとるよ)" : "그렇게 계속 먹고만 있으면 살쪄",
	"もう親に甘えてばかりはいられないので自立することにした (もうおやにあまえてばかりはいられないのでじりつすることにした)" : "이제 부모님께 어리광만 부릴 수는 없어서 독립하기로 했다",


	"ここで冗談を言っても仕方がない (ここでじょうだんをいってもしかたがない)" : "여기서 농담을 해도 소용없다",
	"泣いたって仕方がない (ないたってしかたがない)" : "울어도 소용없다",
	"そんなことを悔やんでも始まらない (そんなことをくやんでもはじまらない)" : "그런 것을 후회해도 어쩔 수 없다",
	"今さらじたばたしたって始まらない (いまさらじたばたしたってはじまらない)" : "이제 와서 발버둥쳐도 소용없다",
	"落ち込んでばかりいても始まらない (おちこんでばかりいてもはじまらない)" : "우울해하고만 있어도 소용없다",
	"あきれ果てたり、褒めたりしても仕方ない (あきれはてたり、ほめたりしてもしかたない)" : "어이가 없거나 칭찬해도 소용없다",
	"全然勉強していないんだから、試験に落ちてもしかたがない (ぜんぜんべんきょうしていないんだから、しけんにおちてもしかたがない)" : "전혀 공부를 안 하니까, 시험에 떨어져도 어쩔 수 없다",
	"後になって悔しがっても始まらない (あとになってくやしがってもはじまらない)" : "나중에 분해서 여겨도 소용없다",


	"子どものころの思い出とあいまって (こどものころのおもいでとあいまって)" : "어릴 적 추억과 더불어",
	"人一倍の努力とあいまって (ひといちばいのどりょくとあいまって)" : "남보다 배의 노력과 더불어",
	"厳しい経済状況もあいまって (きびしいけいざいじょうきょうもあいまって)" : "심각한 경제 상황도 겹쳐서",
	"温暖な気候と適度な雨量とがあいまって (おんだんなきこうとてきどなうりょうとがあいまって)" : "온난한 기후와 적당한 강우량이 어우러져",
	"澄んだ青空と相まって (すんだあおぞらとあいまって)" : "맑고 푸른 하늘과 어우러져",
	"監督の熱意と出演者の努力とがあいまって、素晴らしい番組ができ上がった (かんとくのねついとしゅつえんしゃのどりょくとがあいまって、すばらしいばんぐみができあがった)" : "감독의 열의와 출연자의 노력이 어우러져 멋진 프로그램이 완성되었다",
}

nihongo_11 = {

	"『ヨーロッパの鉄道旅行』というテレビ番組 (『よーろっぱのてつどうりょこう』というてれびばんぐみ)" : "『유럽의 철도여행』이라는 TV 프로그램",
	"慎重というより無能に近い (しんちょうというよりむのうにちかい)" : "신중하다기보다 무능에 가깝다",
	"単純というか素朴な感じだ (たんじゅんというかそぼくなかんじだ)" : "단순하다기보다 소박한 느낌이다",
	"大胆というか無謀というか (だいたんというかむぼうというか)" : "대담하다기보다 무모하다고 할까",
	"能力というより人気と知名度による (のうりょくというよりにんきとちめいどによる)" : "능력이라기보다 인기와 지명도에 의한",
	"赤ちゃんを一見しようという多くの人で (あかちゃんをいちけんしようというおおくのひとで)" : "아기를 한 번 보려는 많은 사람들로",
	"存続は難しいのではという危機感 (そんぞくはむずかしいのではというききかん)" : "존속은 어렵지 않을까 하는 위기감",
	"これだけは譲れないというこだわり (これだけはゆずれないというこだわり)" : "이것만은 양보할 수 없다는 고집",
	"どう考えてもさすがに無理ってもんだ (どうかんがえてもさすがにむりってもんだ)" : "어떻게 생각해도 역시 무리다",
	"冗談だってことくらい (じょうだんだってことくらい)" : "농담이라는 것쯤도",
	"今日、鈴木さんという方が見えました (きょう、すずきさんというかたがみえました)" : "오늘, 스즈키 씨라는 분이 오셨습니다",
	"姉と年が離れているので、兄弟というより親子のようだ (あねととしがはなれているので、きょうだいというよりおやこのようだ)" : "누나(언니)와 나이 차이가 나서, 형제라기보다 부모자식 같다",
	"一人であんな危険な場所へ行くとは、無茶というか、無知というか、とにかく私は理解できない (ひとりであんなきけんなばしょへいくとは、むちゃというか、むちというか、とにかくわたしはりかいできない)" : "혼자서 그런 위험한 장소에 가다니, 당차다기보다 무지라고 할까, 아무튼 나는 이해가 가지 않는다",


	"旅行というと (りょこうというと)" : "여행이라고 하면",
	"日本と言えば (にほんといえば)" : "일본이라고 하면",
	"その心細さといったら (そのこころぼそさといったら)" : "그 불안함으로 말할 것 같으면",
	"あの娘の美しさといったら (あのこ の うつくしさ といったら)" : "그 아가씨의 아름다움은 (정말)",

	"外出といったら近所のスーパーに行く程度 (がいしゅつといったらきんじょのすーぱーにいくていど)" : "외출로 말할 것 같으면 근처 슈퍼마켓에 가는 정도",
	"自然に囲まれたのどかな所であると言えば (しぜんにかこまれたのどかところであるといえば)" : "자연에 둘러싸인 한가로운 곳이라고 하면",
	"少しも不安がなかったといえば (すこしもふあんがなかったといえば)" : "조금도 불안감이 없었다고 하면",
	"一般的にビジネス書というと (いっぱんてきにびじねすしょというと)" : "일반적으로 비즈니스 서적이라고 하면",
	"日本の代表的な都市というと、東京や大阪があげられます (にほんのだいひょうてきなとしというと、とうきょうやおおさかがあげられます)" : "일본의 대표적인 도시라고 하면, 도쿄나 오사카를 들 수 있습니다",
	"病気といえば、子供の時にしかかったぐらいでいたって健康です (びょうきといえば、こどものときにしかかったぐらいでいたってけんこうです)" : "병이라고 하면, 어릴 때 홍역에 걸린 정도이고 아주 건강합니다",
	"あの時の恥ずかしかったことといったら、本当に穴があったら入りたい思いだった (あのときのはずかしかったことといったら、ほんとうにあながあったらはいりたいおもいだった)" : "그때의 부끄러웠던 일을 말할 것 같으면, 정말로 구멍이 있다면 들어가고 싶은 심정이었다",


	"長野はきのう大雪だったとか (ながのはきのうおおゆきだったとか)" : "나가노는 어제 큰 눈이 내렸다던데",
	"また公共料金が上がるとか (こうきょうりょうきんがあがるとか)" : "또 공공요금이 오른다던데",
	"結婚式に行くとか (けっこんしきにいくとか)" : "결혼식에 간다고 하면서",
	"急用ができたとかで (きゅうようができたとかで)" : "급한 용무가 생겼다면서",
	"どうだってかまわないとか (どうだってかまわないとか)" : "어떻든 상관없다던데",
	"最近テレビで紹介されたとかで (さいきんてれびでしょうかいされたとかで)" : "요즘 TV에서 소개되었다고 하면서",
	"雌に限っての行動なのだとか (めすにかぎってのこうどうなのだとか)" : "암컷에 한정된 행동이라던데",
	"病院での４年間はOL時代には感じることのできなかった楽しさだったとか (びょういんでのよねんかんはおーえるじだいにはかんじることのできなかったたのしさだったとか)" : "병원에서의 4년간은 회사 다닐 때에는 느낄 수 없었던 즐거움이 있었다던데",
	"急用ができたとかで、今帰りました。 (きゅうようができたとかで、いまかえりました)" : "급한 용무가 생겼다면서 방금 돌아갔어요",


	"締め切りに間に合わなくなるところだった (しめきりにまにあわなくなるところだった)" : "마감에 맞출 수 없게 될 뻔했다",
	"もう少しで忘れるところだった (もうすこしでわすれるところだった)" : "하마터면 잊어버릴 뻔했다",
	"危うく大変なことになるところだった (あやうくたいへんなことになるところだった)" : "하마터면 큰일날 뻔했다",
	"教えてもらわなかったら、見逃すところでした (おしえてもらわなかったら、みのがすところでした)" : "가르쳐주지 않았다면 놓칠 뻔했습니다",
	"危うく入会させられるところだった (あやうくにゅうかいさせられるところだった)" : "하마터면 가입할 뻔했다",
	"ちゃんと前を見て運転してよ。今となりの車にぶつかるところだったよ (ちゃんとまえをみてうんてんしてよ。いまとなりのくるまにぶつかるところだったよ)" : "앞을 제대로 보고 운전해. 지금 옆 차에 부딪힐 뻔했어",


	"最終のバスに間に合わなくて困っていたところに (さいしゅうのばすにまにあわなくてこまっていたところに)" : "막차를 놓쳐 난처해 하고 있던 참에",
	"ちょうど顔を洗っていたところへ (ちょうどかおをあらっていたところへ)" : "마침 세수하고 있던 참에",
	"あんなに喜んでいるところをみると (あんなによろこんでいるところをみると)" : "그토록 기뻐하고 있는 것을 보면",
	"笑顔だったところをみると (えがおだったところをみると)" : "웃는 얼굴이었던 것을 보면",
	"毎日使っているところを見ると (まいにちつかっているところをみると)" : "매일 사용하고 있는 것을 보면",
	"表情が明るいところを見ると (ひょうじょうがあかるいところをみると)" : "표정이 밝은 것을 보면",
	"引っ越しの荷造りができずにいたところに (ひっこしのにづくりができずにいたところに)" : "이삿짐을 못 싸고 있던 참에",
	"ちょうど出かけようとしていたところへ、国の母から小包が届いた (ちょうどでかけようとしていたところへ、くにのははからこづつみがとどいた)" : "마침 나가려던 참에, 고향에 있는 어머니로부터 소포가 도착했다",
	"店の前に長い行列ができているところを見ると、大変人気のあるラーメン屋のようだ (みせのまえにながいぎょうれつができているところをみると、たいへんにんきのあるらーめんやのようだ)" : "가게 앞에 긴 줄이 생긴 것을 보면, 매우 인기 있는 라면집인 것 같다",


	"近代建築私としては (きんだいけんちくわたしとしては)" : "근대건축에 흥미가 있는 나로서는",
	"自分の責任として (じぶんのせきにんとして)" : "자기 책임이라고 해서",
	"さまざまな障害に出会ったとしても (さまざまなしょうがいにであったとしても)" : "여러 장애를 만났다고 해도",
	"行くとすれば明日だ (いくとすればあしただ)" : "간다고 하면 내일이다",
	"ここに100万円あるとしたら (ここにひゃくまんえんあるとしたら)" : "여기에 100만 엔 있다고 하면",
	"突然の解雇を不当だとして (とつぜんのかいこをふとうだとして)" : "갑작스런 해고를 부당하다고 하여",
	"目が多少かゆくなるくらいはいいとしても (めがたしょうかゆくなるくらいはいいとしても)" : "눈이 약간 가려워지는 정도는 괜찮다고 해도",
	"著者としてこれ以上の喜びはない (ちょしゃとしてこれいじょうのよろこびはない)" : "저자로서 더 이상의 기쁨은 없다",
	"石川さんでないとすれば (いしかわさんでないとすれば)" : "이시카와 씨가 아니라면",
	"欠かせないイベントとして有名だ (かかせないいべんととしてゆうめいだ)" : "빼뜨릴 수 없는 이벤트로 유명하다",
	"私としては石原さんの考えに賛成しかねます (わたしとしてはいしはらさんのかんがえにさんせいしかねます)" : "저로서는 이시하라 씨의 생각에 찬성할 수 없습니다",
	"どれだけ頑張ったとしても、村上選手にはかなわない (どれだけがんばったとしても、むらかみせんしゅにはかなわない)" : "아무리 노력했다 해도 무라카미 선수는 못 이긴다",
	"これだけ大量の農薬が使用され続けるとすれば、人畜に与える害は計り知れない (これだけたいりょうののうやくがしようされつづけるとすれば、じんちくにあたえるがいははかりしれない)" : "이만큼 많은 농약이 계속 사용된다고 하면, 사람과 가축에게 주는 피해는 헤아릴 수 없다",


	"出席できないとの返事 (しゅっせきできないとのへんじ)" : "참석할 수 없다는 답장",
	"異常があったとの連絡 (いじょうがあったとのれんらく)" : "이상이 있었다는 연락",
	"タオルや洗剤といった (たおるやせんざいといった)" : "타올이나 세제라는",
	"環境への配慮といった (かんきょうへのはいりょといった)" : "환경에 대한 배려라는",

	"借金といっても (しゃっきんといっても)" : "빚이라고 해도",
	"酒が飲めないといっても (さけがのめないといっても)" : "술을 못 마신다고 해도",
	"インターネットの功罪といった議論 (いんたーねっとのこうざいといったぎろん)" : "인터넷의 공죄(공로와 죄과)라는 논의",
	"日本一といっても過言ではない (にほんいちといってもかごんではない)" : "일본 제일이라고 해도 과언이 아니다",
	"詳細な調査をする必要があるとの報告 (しょうさいなちょうさをするひつようがあるとのほうこく)" : "상세한 조사를 할 필요가 있다는 보고",
	"シャツにジーンズといったカジュアルな格好 (しゃつにじーんずといったかじゅあるなかっこう)" : "셔츠에 청바지라는 캐주얼한 차림",
	"印刷の設定ができないとの問い合わせ (いんさつのせっていができないとのといあわせ)" : "인쇄 설정을 할 수 없다는 문의",
	"社長が辞任すべきだとの考えに変わりはありません (しゃちょうがじにんすべきだとのかんがえにかわりはありません)" : "사장이 사임해야 한다는 생각에 변함은 없습니다",
	"この夏は赤や黄色といった派手な色が流行らしい (このなつはあかやきいろといったはでないろがはやりらしい)" : "올여름은 빨강이나 노랑이라는 화려한 색이 유행할 것 같다",
	"果物といってもいろいろあるが、私はいちごが好きだ (くだものといってもいろいろあるが、わたしはいちごがすきだ)" : "과일이라고 해도 여러 가지가 있지만, 나는 딸기를 좋아한다",


	"同一の結果が得られるとは限らない (どういつのけっかがえられるとはかぎらない)" : "동일한 결과를 얻을 수 있다고는 할 수 없다",
	"音楽のセンスがいいとも限らない (おんがくのせんすがいいともかぎらない)" : "음악 센스가 좋다고도 할 수 없다",
	"雨が降らないともかぎらないから (あめがふらないともかぎらないから)" : "비가 오지 않는다고도 할 수 없으니까",
	"すべて欠航にならないともかぎらない (すべてけっこうにならないともかぎらない)" : "모두 결항이 될지도 모른다",
	"太っているからといって大食いとは限らない (ふとっているからといっておおぐいとはかぎらない)" : "뚱뚱하다고 해서 대식가라고는 할 수 없다",
	"準備体操をしないと、首の骨を折るような事故を起こさないともかぎらない (じゅんびたいそうをしないと、くびのほねをおるようなじこをおこさないともかぎらない)" : "준비 체조를 하지 않으면, 목뼈가 부러지는 사고를 낼지도 모른다",


	"いくら高くとも (いくらたかくとも)" : "아무리 비싸도",
	"何をしようとも (なにをしようとも)" : "무엇을 하더라도",
	"つらくとも" : "괴롭더라도",
	"つらくても" : "괴롭더라도",
	"どのような批判を浴びようとも (どのようなひはんをあびようとも)" : "어떤 비판을 받더라도",
	"一人で行っても誰かしら友達に会うので (ひとりでいってもだれかしらともだちにあうので)" : "혼자 가더라도 누군가 친구를 만나기 때문에",
	"誰に何と言われようとも (だれになんといわれようとも)" : "누구한테 무슨 말을 듣더라도",
	"独りのときは誰が来ようとも玄関の声を開けてはいけないよ (ひとりのときはだれがこようともげんかんのこえをあけてはいけないよ)" : "혼자일 때는 누가 오더라도 현관문을 열어서는 안 돼",
	"いくら頭がよくても、他人に対する思いやりがなければ人間として失格だ (いくらあたまがよくても、たにんにたいするおもいやりがなければにんげんとしてしっかくだ)" : "아무리 머리가 좋아도, 타인에 대한 배려가 없으면 인간으로서 실격이다",


	"あなたの気持ちは、わからないでもないが (あなたのきもちわからないでもないが)" : "당신의 기분을 모르는 것도 아니지만",
	"一人で行けなくもないが (ひとりでいけなくもないが)" : "혼자 못 가는 것도 아니지만",
	"理解できなくはない (りかいできなくはない)" : "이해할 수 없는 것은 아니다",
	"まだ少し問題がある気がしないでもないが (まだすこしもんだいがあるきがしないでもないが)" : "아직 조금 문제가 있는 기분이 들지 않는 것도 아니지만",
	"Mサイズも着られなくはなかった (えむさいずもきられなくはなかった)" : "M사이즈도 입지 못하는 것은 아니었다",
	"歩こうとして歩けなくもない (あるこうとしてあるけなくもない)" : "걸으려고 하면 못 걷는 것도 아니다",
	"今回の計画について、部長が反対する理由もわからないでもない (こんかいのけいかくについて、ぶちょうがはんたいするりゆうもわからないでもない)" : "이번 계획에 대해 부장님이 반대하는 이유도 모르는 것도 아니다",
	"飲まなくもないんですが、あまり強くはありません (のまなくもないんですが、あまりつよくはありません)" : "안 마시는 것도 아닌데, 별로 세지는 않아요",
	"早めに結婚したいという気持ちもわからなくはない (はやめにけっこんしたいというきもちもわからなくはない)" : "일찍 결혼하고 싶다는 기분도 모르는 것은 아니다",


    }

nihongo_12 = {
	"拍手の中を (はくしゅのなかを)": "박수를 받으면서",
	"これまで生きてきた中で (これまでいきてきたなかで)": "지금까지 살아온 중에",
	"私の聞いた中では (わたしのきいたなかでは)": "내가 들은 것 중에서는",    

    "被害者の方の話を聞かせていただく中で (ひがいしゃのかたのはなしをきかせていただくなかで)": "피해자 분들의 말씀을 듣는 중에",
	"人手不足が深刻している中で (ひとでぶそくがしんこくしているなかで)": "일손 부족이 심각해지고 있는 중에",
	"この嵐の中を出かけるなんて、彼らもどうかしているよ。 (このあらしのなかをでかけるなんて、かれらもどうかしているよ)": "이 폭풍우 속을 나가다니, 그들도 어떻게 됐어.",
	"対談する中で気になった情報を積極的に聞き出すことがポイントです。 (たいだんするなかできになったじょうほうをせっきょくてきにききだすことがポイントです)": "대담하는 중에 궁금했던 정보를 적극적으로 알아내는 것이 포인트입니다.",
	"私の聞いた中では、今までで最高の演奏だった。 (わたしのきいたなかでは、いままででさいこうのえんそうだった)": "내가 들은 것 중에서는 지금까지 최고의 연주였다",


	"マスターしなければならない (マスターしなければならない)": "마스터해야 한다",
	"料金を払わなくてはならない (りょうきんをはらわなくてはならない)": "요금을 지불하지 않으면 안 된다",
	"どうせやらなきゃいけない (どうせやらなきゃいけない)": "어차피 해야 한다",
	"遅いからもう行かなくちゃ (おそいからもういかなくちゃ)": "늦었으니까 이제 가야 돼",
	"母親でなくてはならないかというと (ははおやでなくてはならないかというと)": "엄마가 아니면 안 되느냐 하면",
	"そんなの、やってみなきゃわからないよ (そんなの、やってみなきゃわからないよ)": "그런 거 해보지 않으면 몰라",

	"入らなきゃいけないってわけじゃないし (はいらなきゃいけないってわけじゃないし)": "들어가야 한다는 것은 아니고",
	"面白いものを選ばなければならない (おもしろいものをえらばなければならない)": "재미있는 것을 골라야 한다",
	"君は一刻も早く医者に診てもらわなくてはならない (きみはいっこくもはやくいしゃにみてもらわなくてはならない)": "너는 한시라도 빨리 의사에게 진찰을 받지 않으면 안 된다",
	"20歳以上のすべての国民は、国民年金に入らねばならない (はたちいじょうのすべてのこくみんは、こくみんねんきんにはいらねばならない)": "20세 이상의 모든 국민은 국민연금에 가입해야 한다",
	"やらなきゃいけないことだって、いっぱいあるよ (やらなきゃいけないことだって、いっぱいあるよ)": "하지 않으면 안 될 일도 엄청 있어",
	"明日までにどうしてもこれを終わらせないとならないんです (あしたまでにどうしてもこれをおわらせないとならないんです)": "내일까지 어떻게든 이걸 끝내야 합니다",


	"新入社員ならいざしらず (しんにゅうしゃいんならいざしらず)": "신입사원이라면 몰라도",
	"急用があるんならともかく (きゅうようがあるんならともかく)": "급한 일이 있다면 몰라도",
	"単なる冗談ならまだしも (たんなるじょうだんならまだしも)": "단순한 농담이라면 몰라도",
	"自分のことについてならともかく (じぶんのことについてならともかく)": "자기에 관해서라면 몰라도",
	"プロの写真家ならまだしも (ぷろのしゃしんかならまだしも)": "프로 사진가라면 몰라도",
	"専門家ならいざしらず、素人ではこの機械を修理することはできない (せんもんかならいざしらず、しろうとではこのきかいをしゅうりすることはできない)": "전문가라면 몰라도, 초보자는 이 기계를 수리할 수는 없다",
	"10年前ならともかく、今はそんな服は着られないよ (じゅうねんまえならともかく、いまはそんなふくはきられないよ)": "10년 전이라면 몰라도, 지금은 그런 옷은 못 입어",


	"安全性において (あんぜんせいにおいて)": "안전성에서",
	"日本における学校給食 (にほんにおけるがっこうきゅうしょく)": "일본에서의 학교급식",
	"物理学においては (ぶつりがくにおいては)": "물리학에서는",
	"自然現象においても (しぜんげんしょうにおいても)": "자연현상에서도",
	"この経済不況下においてさえ (このけいざいふきょうかにおいてさえ)": "이 경제 불황 하에서조차",

	"脳科学の研究が進んだと言われる現代においてさえ (のうかがくのけんきゅうがすすんだといわれるげんだいにおいてさえ)": "뇌과학 연구가 진척되었다고 하는 현대에서조차",
	"現在における15歳未満の人口 (げんざいにおけるじゅうごさいみまんのじんこう)": "현재에서의 15세 미만의 인구",
	"卒業式は体育館において9時より開催いたします (そつぎょうしきはたいいくかんにおいてくじよりかいさいいたします)": "졸업식은 체육관에서 9시부터 개최합니다",
	"現代の科学の時代においても多くの迷信が残っている (げんだいのかがくのじだいにおいてもおおくのめいしんがのこっている)": "오늘날의 과학 시대에서도 많은 미신이 남아 있다",
	"世界におけるその国の役割はますます重要になってきている (せかいにおけるそのくにのやくわりはますますじゅうようになってきている)": "세계에서의 그 나라의 역할은 더욱더 중요해지고 있다",


	"味の良さにかけては (あじのよさにかけては)": "맛이 좋은 것에 있어서는",
	"歌うことにかけても (うたうことにかけても)": "노래 부르는 것에 있어서도",
	"音楽を作る才能にかけては (おんがくをつくるさいのうにかけては)": "음악을 만드는 재능에 있어서는",
	"アメリカ研究にかけてはスミス博士は最も権威ある学者である (アメリカけんきゅうにかけてはスミスはかせはもっともけんいあるがくしゃである)": "미국 연구에 있어서는 스미스 박사는 가장 권위 있는 학자이다",


	"父の病気にかこつけて (ちちのびょうきにかこつけて)": "아버지의 병환을 구실로",
	"いつも何かにかこつけて (いつもなにかにかこつけて)": "항상 무언가를 핑계 삼아",
	"頭痛をいいことに (ずつうをいいことに)": "두통을 핑계 삼아",
	"何も言われないのをいいことに (なにもいわれないのをいいことに)": "아무 말도 안 듣는 것을 구실로",
	"誰にも何も言われないのをいいことに (だれにもなにもいわれないのをいいことに)": "누구한테도 아무 말도 듣지 않는 것을 핑계 삼아",
	"彼は、母親の病気にかこつけて会に出席しなかった (かれは、ははおやのびょうきにかこつけてかいにしゅっせきしなかった)": "그는 어머니의 병환을 구실로 모임에 참석하지 않았다",
	"上司の留守をいいことに、彼は万事を思いどおりにした (じょうしのるすをいいことに、かれはばんじをおもいどおりにした)": "상사의 부재를 핑계 삼아, 그는 만사를 마음대로 했다",


	"夏の低温に加えて (なつのていおんにくわえて)": "여름의 저온에 더하여",
	"人件費の高騰に加えて (じんけんひのこうとうにくわえて)": "인건비의 급등에 더하여",
	"一般公開に先立ち (いっぱんこうかいにさきだち)": "일반 공개에 앞서",
	"競技に先立ち (きょうぎにさきだち)": "경기에 앞서",
	"同美術館ではこれに先立ち (どうびじゅつかんではこれにさきだち)": "동미술관에서는 이에 앞서",
	"人手不足に加えて地価の高騰が追い討ちをかけてとうとう倒産した (ひとでぶそくにくわえてちかのこうとうがおいうちをかけてとうとうとうさんした)": "일손 부족에다 지가 급등이 연타를 가해 결국 도산했다",
	"ビルの建設に先立ち、市の職員によって地盤の調査が行われた (ビルのけんせつにさきだち、しのしょくいんによってじばんのちょうさがおこなわれた)": "빌딩 건설에 앞서, 시의 직원에 의해 지반 조사가 이루어졌다",


	"ドアの鍵を二つつけるなど用心するにこしたことはない (ドアのかぎをふたつつけるなどようじんするにこしたことはない)": "문 열쇠를 두 개 다는 등 조심하는 것보다 나은 것은 없다",
	"勉強したいなら、早くうちに帰るにこしたことはない (べんきょうしたいなら、はやくうちにかえるにこしたことはない)": "공부하고 싶다면 빨리 집에 가는 게 제일이다",
	"品質が同じなら、安いにこしたことはない (ひんしつがおなじなら、やすいにこしたことはない)": "품질이 같다면 싼 게 제일이다",
	"知識はあるに越したことはありませんが (ちしきはあるにこしたことはありませんが)": "지식은 있는 게 제일이지만",
	"入学願書の締め切りは月末だけれど、早めに出せるならそれにこしたことはない (にゅうがくがんしょのしめきりはげつまつだけれど、はやめにだせるならそれにこしたことはない)": "입학 원서 마감은 월말이지만, 일찍 제출할 수 있으면 그것보다 나은 것은 없다",


	"あの人の身にしたら (あのひとのみにしたら)": "그 사람의 입장으로서는",
	"姉にすれば (あねにすれば)": "언니로서는",
	"日本人にしてみれば (にほんじんにしてみれば)": "일본인의 입장에서 보면",
	"両親にしても (りょうしんにしても)": "부모님이라고 해도",
	"その話が本当であるにしても (そのはなしがほんとうであるにしても)": "그 이야기가 사실이라고 해도",
	"この料理は初めてにしたって (このりょうりははじめてにしたって)": "이 요리는 처음이라고 해도",
	"完全に失われることはないにしても (かんぜんにうしなわれることはないにしても)": "완전히 잃어버리는 일은 없다고 해도",
	"メールの書き方ひとつにしても (メールのかきかたひとつにしても)": "메일 쓰는 법 하나라고 해도",
	"地元の人にしてみれば (じもとのひとにしてみれば)": "현지인의 입장에서 보면",
	"あの人の立場にしたら、そんなことはできなかっただろう (あのひとのたちばにしたら、そんなことはできなかっただろう)": "그 사람의 입장에서는, 그런 일은 할 수 없었을 것이다",
	"中学生のピアスや化粧がいいとは、私には思えない。しかし彼らにしてみれば、あれも自己表現の手段なのだ (ちゅうがくせいのピアスやけしょうがいいとは、わたしにはおもえない。しかしかれらにしてみれば、あれもじこひょうげんのしゅだんなのだ)": "중학생의 귀걸이나 화장이 좋다고는 나는 생각되지 않는다. 그러나 그들 입장에서는, 그것도 자기 표현의 수단인 것이다",
	"部屋の飾りつけ一つにしても、その家に住んでいる人の細やかな心遣いが表されている (へやのかざりつけひとつにしても、そのいえにすんでいるひとのこまやかなこころづかいがあらわされている)": "방의 장식 하나만 봐도, 그 집에 살고 있는 사람의 세심한 배려가 나타나 있다",


	"小学生にしては (しょうがくせいにしては)": "초등학생치고는",
	"タクシーの運転手にしては (タクシーのうんてんしゅにしては)": "택시 기사치고는",
	"初めてケーキを作ったにしては (はじめてケーキをつくったにしては)": "처음 케이크를 만든 것치고는",
	"それにしては (それにしては)": "그것치고는",
	"山道に走るバスに揺られながらにしては (やまみちにはしるバスにゆられながらにしては)": "산길을 달리는 버스에 흔들리면서 한 것치고는",
	"この店のカレーライスはこの値段にしてはおいしい (このみせのカレーライスはこのねだんにしてはおいしい)": "이 가게의 카레라이스는 이 가격치고는 맛있다",



}

nihongo_13 = {
    "引き受けるにしろ引き受けないにしろ (ひきうけるにしろひきうけないにしろ)": "떠맡든 떠맡지 않든",
	"与党にしろ野党にしろ (よとうにしろやとうにしろ)": "여당이든 야당이든",
	"たった二日の旅行にしろ (たったふつかのりょこうにしろ)": "겨우 이틀의 여행이라 하더라도",
	"部長に指示されてやったことあるにせよ (ぶちょうにしじされてやったことあるにせよ)": "부장님에게 지시를 받아 한 일이라 하더라도",
	"A社が開発したものには遠く及ばないにしろ (えーしゃがかいはつしたものにはとおくおよばないにしろ)": "A사가 개발한 것에는 훨씬 못 미친다 하더라도",
	"本当にしろうそにしろ大したことじゃない (ほんとうにしろうそにしろたいしたことじゃない)": "정말이든 거짓이든 별일 아냐",
	"どんな理由にしろ、暴力をふるうのはよくない (どんなりゆうにしろ、ぼうりょくをふるうのはよくない)": "어떤 이유로 해도 폭력을 휘두르는 것은 좋지 않다",
	"無礼とまでは言わないにせよ、彼はぶっきらぼうに話した (ぶれいとまではいわないにせよ、かれはぶっきらぼうにはなした)": "무례하다고까지는 말하지 않더라도, 그는 퉁명스럽게 말했다",


	"彼の作品を見るにつけ (かれのさくひんをみるにつけ)": "그의 작품을 볼 때마다",
	"何かにつけて (なにかにつけて)": "무슨 일이 있을 때마다, 걸핏하면",
	"いいにつけ悪いにつけ (いいにつけわるいにつけ)": "좋든 싫든",
	"雨につけ風につけ (あめにつけかぜにつけ)": "비가 오나 바람이 부나",
	"それにつけても (それにつけても)": "그것과 관련하여도, 하여간",
    
	"都会から田舎に移り住んだ人の話を聞くにつけ (とかいからいなかにうつりすんだひとのはなしをきくにつけ)": "도시에서 시골로 이주한 사람의 이야기를 들을 때마다",
	"美しい海を見るにつけ (うつくしいうみをみるにつけ)": "아름다운 바다를 볼 때마다",
	"彼は何かにつけてその話を持ち出す (かれはなにかにつけてそのはなしをもちだす)": "그는 걸핏하면 그 얘기를 꺼낸다",
	"電子辞典の登場は良きにつけ悪しきにつけ出版界に多大な影響を与えた (でんしじてんのとうじょうはよきにつけあしきにつけしゅっぱんかいにただいなえいきょうをあたえた)": "전자사전의 등장은 좋든 나쁘든 출판계에 지대한 영향을 끼쳤다",
	"それにつけても人は見かけによらないものだ (それにつけてもひとはみかけによらないものだ)": "그것과 관련하여 사람은 겉보기와는 다른 법이다",


	"ほとんどの国民にとって (ほとんどのこくみんにとって)": "대부분의 국민에게",
	"外国人にとっても (がいこくじんにとっても)": "외국인에게 있어서도",
	"娘にとっての父親 (むすめにとってのちちおや)": "딸에게 있어서의 아버지",

	"私にとってはどうでもいい (わたしにとってはどうでもいい)": "나에게는 아무 상관없다",
	"子供の教育にとっていちばん大切なものは何だと思いますか (こどものきょういくにとっていちばんたいせつなものはなんだとおもいますか)": "자녀교육에 있어서 가장 중요한 것은 무엇이라고 생각합니까?",
	"その本は初心者にとっては難しすぎる (そのほんはしょしんしゃにとってはむずかしすぎる)": "그 책은 초보자에게는 너무 어렵다",
	"ドイツ人にとってのジャガイモは日本人にとってのお米みたいなものだ (ドイツじんにとってのジャガイモはにほんじんにとってのおこめみたいなものだ)": "독일인에게 있어서 감자는 일본인에게 있어서 쌀과 같은 것이다",


	"森林の減少にともなって (しんりんのげんしょうにともなって)": "삼림의 감소에 따라",
	"景気が回復するにともない (けいきがかいふくするにともない)": "경기가 회복함에 따라",
	"都心の人口増加にともなう住宅問題 (としんのじんこうぞうかにともなうじゅうたくもんだい)": "도심의 인구 증가에 따른 주택 문제",
	"急激な経済成長にともない (きゅうげきなけいざいせいちょうにともない)": "급격한 경제 성장에 따라",
	"航空料金の変更に伴ってツアー代金も変更になります (こうくうりょうきんのへんこうにともなってツアーだいきんもへんこうになります)": "항공요금의 변경에 따라 투어대금도 변경됩니다",
	"そのスキャンダルの発覚にともない、彼は辞職に追い込まれた (そのスキャンダルのはっかくにともない、かれはじしょくにおいこまれた)": "그 스캔들의 발각에 따라, 그는 사직에 내몰렸다",


	"夏には (なつには)": "여름에는",
	"私にはわからない (わたしにはわからない)": "나는 모르겠다",
	"洗濯物をきれいに洗うには (せんたくものをきれいにあらうには)": "빨래를 깨끗하게 빨려면",
	"大型犬を飼うにはある程度の広さの家が必要だ (おおがたけんをかうにはあるていどのひろさのいえがひつようだ)": "대형견을 기르려면 어느 정도 넓이의 집이 필요하다",
	"君が何を言おうと私は問題ではない (きみがなにをいおうとわたしはもんだいではない)": "네가 무슨 말을 하든 나에게는 문제가 아니다",


	"心配な点もあるにはあるが (しんぱいなてんもあるにはあるが)": "걱정되는 점도 있긴 있지만",
	"説明するにはしたが (せつめいするにはしたが)": "설명하기는 했지만",
	"第一志望校に願書を出すには出したが、受験はしなかった (だいいちしぼうこうにがんしょをだすにはだしたが、じゅけんはしなかった)": "제1지망 학교에 원서를 내긴 냈지만, 시험은 보지 않았다",
	"ゆうべのパーティーに行くには行ったが、誰が来ていたか覚えていません (ゆうべのパーティーにいくにはいったが、だれがきていたかおぼえていません)": "어젯밤 파티에 가기는 갔지만, 누가 왔었는지는 기억나지 않습니다",


	"努力の結果にほかならない (どりょくのけっかにほかならない)": "노력의 결과임에 틀림없다",
	"みんなが関心を持っているからにほかならない (みんながかんしんをもっているからにほかならない)": "바로 모두가 관심을 갖고 있기 때문이다",
	"信頼できる仲間がいたからにほかならない (しんらいできるなかまがいたからにほかならない)": "바로 신뢰할 수 있는 동료가 있었기 때문이다",
	"あなたの言ったことはセクハラにほかなりません (あなたのいったことはセクハラにほかなりません)": "당신이 한 말은 바로 성희롱입니다",
	"若い人が外国語を好むのは、それなりの理由があるからにほかならない (わかいひとががいこくごをこのむのは、それなりのりゆうがあるからにほかならない)": "젊은 사람이 외국어를 좋아하는 것은, 바로 그 나름의 이유가 있기 때문이다",


	"わが社は学歴によらず (わがしゃはがくれきによらず)": "우리 회사는 학력에 관계없이",
	"国によって違う (くにによってちがう)": "나라에 따라 다르다",
	"値段によっては (ねだんによっては)": "가격에 따라서는",
	"「音楽の夢」によって (「おんがくのゆめ」によって)": "‘음악의 꿈’에 의해",
	"わが社は性別や年齢によらず本人の実力で採用を決めている (わがしゃはせいべつやねんれいによらずほんにんのじつりょくでさいようをきめている)": "우리 회사는 성별이나 나이에 관계없이 본인의 실력으로 채용을 결정하고 있다",
	"場合によっては君に会社を辞めてもらうことになるかもしれない (ばあいによってはきみにかいしゃをやめてもらうことになるかもしれない)": "경우에 따라서는 자네가 회사를 그만두어야 할지도 몰라",


	"何年にもわたる研究の末に (なんねんにもわたるけんきゅうのすえに)": "몇 년이나 걸친 연구 끝에",
	"厳しいレースを勝ちぬいた末に (きびしいレースをかちぬいたすえに)": "힘든 경주를 이겨낸 끝에",
	"悩みに悩みぬいた末の結論 (なやみになやみぬいたすえのけつろん)": "고민에 고민을 거듭한 끝에 내린 결론",
	"相手の激しい攻撃に耐えぬいた末に (あいてのはげしいこうげきにたえぬいたすえに)": "상대의 거센 공격을 끝까지 견뎌낸 끝에",
	"長年の苦心の末に、山田さんはとうとう実験に成功した (ながねんのくしんのすえに、やまださんはとうとうじっけんにせいこうした)": "오랜 고생 끝에, 야마다 씨는 드디어 실험에 성공했다",
	"よく考えた末に、田中さんはその申し出を断りました (よくかんがえたすえに、たなかさんはそのもうしでをことわりました)": "곰곰이 생각한 끝에, 다나카 씨는 그 제의를 거절했습니다",


	"味方の応援団からのみならず (みかたのおうえんだんからのみならず)": "우리편 응원단에서뿐만 아니라",
	"効果が得られないだけでなく (こうかがえられないだけでなく)": "효과를 얻을 수 없을 뿐만 아니라",
	"楽しいことばかりでなく (たのしいことばかりでなく)": "즐거운 일뿐만 아니라",
	"サッカーに限らず様々なスポーツが (サッカーにかぎらずさまざまなスポーツが)": "축구뿐만 아니라 다양한 스포츠가",
	"成績が学年の上位に入っていることが多いのみならず (せいせきががくねんのじょういにはいっていることがおおいのみならず)": "성적이 학년의 상위에 드는 일이 많은 것뿐만 아니라",
	"森林を単に木材の供給源としてのみではなく (しんりんをたんにもくざいのきょうきゅうげんとしてのみではなく)": "삼림을 단지 목재의 공급원으로서뿐만 아니라",
	"目先の利益だけでなく (めさきのりえきだけでなく)": "눈앞의 이익뿐만 아니라",
	"彼は仲間を理解するのみならず、自らも作っている (かれはなかまをりかいするのみならず、みずからもつくっている)": "그는 하이쿠를 이해할 뿐만 아니라 스스로도 짓고 있다",
	"英語圏の国だけでなく、スペイン語圏の国も旅してみたい (えいごけんのくにだけでなく、スペインごけんのくにもたびしてみたい)": "영어권 나라뿐만 아니라 스페인어권 나라도 여행해보고 싶다",
	"そればかりか、友人たちからも相当の金を借りているらしい (そればかりか、ゆうじんたちからもそうとうのかねをかりているらしい)": "그것뿐만 아니라, 친구들에게서도 상당한 돈을 빌리고 있는 것 같다",
	"中村選手は子供のころ、サッカーに限らずスポーツなら何でも得意だったそうだ (なかむらせんしゅはこどものころ、サッカーにかぎらずスポーツならなんでもとくいだったそうだ)": "나카무라 선수는 어릴 적, 축구뿐만 아니라 스포츠라면 무엇이든 자신 있었다고 한다",


}

nihongo_14 = {
	"食べ過ぎるのじゃなかった (たべすぎるのじゃなかった)": "과식하는 게 아니었다",
	"パソコンが得意だなんて話すんじゃなかった (パソコンがとくいだなんてはなすんじゃなかった)": "컴퓨터를 잘한다는 따위 말하는 게 아니었다",
	"レインコートなんて、着てくるんじゃなかった (レインコートなんて、きてくるんじゃなかった)": "비옷 따위 입고 오는 게 아니었다",
	"ラーメンなんか食べるんじゃなかった (ラーメンなんかたべるんじゃなかった)": "라면 같은 거 먹는 게 아니었다",

	"ダイエット中の人なら、やっぱり食べるのじゃなかった、と後で悔いることも多い (ダイエットちゅうのひとなら、やっぱりたべるのじゃなかった、あとでくいることもおおい)": "다이어트 중인 사람이라면, 역시 먹는 게 아니었어, 하고 나중에 후회하는 일도 많다",
	"あ、困った、こんなことじゃ、招待なんか受けるんじゃなかった (あ、こまった、こんなことじゃ、しょうたいなんかうけるんじゃなかった)": "아, 난처하네, 이런 거라면, 초대 같은 거 수락하는 게 아니었어",


	"気持ちはあせるばかりだ (きもちはあせるばかりだ)": "마음은 초조하기만 하다",
	"物価は上がるばかりで (ぶっかはあがるばかりで)": "물가는 오르기만 해서",
	"あとは客を待つばかりになっている (あとはきゃくをまつばかりになっている)": "이제는 손님을 기다리기만 하면 된다",
	"よけいなことを言ったばかりに (よけいなことをいったばかりに)": "쓸데없는 말을 한 탓에",
	"この仕事を選んだばかりに (このしごとをえらんだばかりに)": "이 일을 선택한 바람에",

	"僕がミスをしたばかりに君にまで残業してもらうことになってしまって… (ぼくがミスをしたばかりにきみにまでざんぎょうしてもらうことになってしまって…)": "내가 실수를 한 바람에 너까지 잔업을 하게 돼서…",
	"あととは出発を待つばかりとなった (あとはしゅっぱつをまつばかりとなった)": "이제는 출발을 기다리기만 하면 되었다",
	"取引先の担当者の名前を間違えたばかりに (とりひきさきのたんとうしゃのなまえをまちがえたばかりに)": "거래처 담당자 이름을 잘못 안 바람에",
	"余計なことをつい言ってしまったばかりに (よけいなことをついいってしまったばかりに)": "그만 쓸데없는 말을 해버린 바람에",
	"全員そろった。あとはバスが来るのを待つばかりだ (ぜんいんそろった。あとはばすがくるのをまつばかりだ)": "전원이 다 모였다. 이제는 버스가 오는 걸 기다릴 뿐이다",
	"荷造りも終わって、もう送り出すばかりになっている (にづくりもおわって、もうおくりだすばかりになっている)": "짐 꾸리기도 끝나고, 이제 보내기만 하면 된다",
	"あとは新郎新婦の入場を待つばかりとなった (あとはしんろうしんぷのにゅうじょうをまつばかりとなった)": "이제는 신랑 신부의 입장을 기다리기만 하게 되었다",
	"彼は家が貧しかったばかりにアルバイトして自力で大学を出たそうだ (かれはいえがまずしかったばかりにあるばいとしてじりきでだいがくをでたそうだ)": "그는 집이 가난한 탓에 아르바이트를 해서 자력으로 대학을 나왔다고 한다",


	"今日はとても眠いはずだ (きょうはとてもねむいはずだ)": "오늘은 아주 졸릴 것이다",
	"山田君が合格するはずがない (やまだくんがごうかくするはずがない)": "야마다군이 합격할 리가 없다",
	"どうりで見えないはずだ (どうりでみえないはずだ)": "그래서 안 보이는 거네",
	"あ、そっか。どうりで空いてるはずだ (あ、そっか。どうりですいてるはずだ)": "아, 그렇구나. 그래서 비어 있는 거네",
	"もっと素晴らしい人生を送れていたはずと後悔する (もっとすばらしいじんせいをおくれていたはずとこうかいする)": "더 멋진 인생을 보낼 수 있었을 텐데 하고 후회하다",
	"その書類のコピーは確か君に頼んだはずだよ (そのしょるいのコピーはたしかきみにたのんだはずだよ)": "그 서류의 복사는 분명 자네에게 부탁했을 거야",
	"彼女とのデートをすっぽかしちゃった (かのじょとのデートをすっぽかしちゃった)": "여자친구와의 데이트를 바람맞혔어",
	"どうりで怒るはずだ (どうりでおこるはずだ)": "그래서 화를 내는 거네",


	"ジャケットを持ってくればよかった (じゃけっとをもってくればよかった)": "재킷을 들고 왔으면 좋았겠다",
	"もっと早く来ればよかった (もっとはやくくればよかった)": "좀 더 빨리 왔다면 좋았겠다",
	"だまっておけばよかったのに (だまっておけばよかったのに)": "입을 다물고 있었으면 좋았을 텐데",
	"声をかけてくれればよかったのに (こえをかけてくれればよかったのに)": "말을 걸어 주었더라면 좋았을 텐데",
	"あの時すぐに治療しておけばよかった (あのときすぐにちりょうしておけばよかった)": "그때 바로 치료해두었으면 좋았겠다",
	"学生時代にもっと真面目に日本語の勉強をしておけばよかった (がくせいじだいにもっとまじめににほんごのべんきょうをしておけばよかった)": "학생 시절에 좀 더 성실하게 일본어 공부를 해두었으면 좋았겠다",
	"あの時、頑張って池田さんに好きって言えばよかったのに (あのとき、がんばっていけださんにすきっていえばよかったのに)": "그때 힘을 내서 이케다 씨에게 좋아한다고 말했더라면 좋았을 텐데",


	"そんなに驚くほどのことではない (そんなにおどろくほどのことではない)": "그렇게 놀랄 만한 일은 아니다",
	"わざわざ大げさに報道するほどのことではない (わざわざおおげさにほうどうするほどのことではない)": "일부러 과장되게 보도할 만한 것은 아니다",
	"自慢するほどのことではないが (じまんするほどのことではないが)": "자랑할 만한 것은 아니지만",
	"このような結果は十分予想できたことであり、驚くほどのことではない (このようなけっかはじゅうぶんよそうできたことであり、おどろくほどのことではない)": "이러한 결과는 충분히 예상할 수 있었던 것이며, 놀랄 만한 일은 아니다",


	"雨は降るまい (あめはふるまい)": "비는 오지 않을 것이다",
	"二度と行くまい (にどといくまい)": "두 번 다시 가지 않겠다",
	"そんなことはあるまい (そんなことはあるまい)": "그런 일은 없을 것이다",
	"帰国したのではあるまいか (きこくしたのではあるまいか)": "귀국한 게 아닐까?",
	"引き受けるしかあるまい (ひきうけるしかあるまい)": "맡을 수밖에 없을 것이다",
	"嫌でも行くしかあるまい (いやでもいくしかあるまい)": "싫어도 갈 수밖에 없을 것이다",

	"交渉を重ねていくしかあるまい (こうしょうをかさねていくしかあるまい)": "교섭을 거듭해갈 수밖에 없을 것이다",
	"正当化するための口実にすぎまい (せいとうかするためのこうじつにすぎまい)": "정당화하기 위한 구실에 지나지 않을 것이다",
	"「近い将来、富士山は噴火するでしょうか。」(ちかいしょうらい、ふじさんはふんかするでしょうか。)": "가까운 장래에 후지산은 분화할까요?",
	"「いや、噴火はすまい。」(いや、ふんかはすまい。)": "아니, 분화는 하지 않을 거야",
	"これからは友達と喧嘩はするまいと反省した (これからはともだちとけんかはするまいとはんせいした)": "앞으로는 친구와 싸우지 않겠다고 반성했다",
	"今まで待っても来ないところをみると、まさか逃げたのではあるまいか (いままでまってもこないところをみると、まさかにげたのではあるまいか)": "지금까지 기다려도 오지 않는 것을 보니, 설마 도망친 게 아닌가",
	"目の前で寿司職人さんが作っているのを見たとあれば買うしかあるまい (めのまえですししょくにんさんがつくっているのをみたとあればかうしかあるまい)": "눈 앞에서 초밥장이 만든 것을 봤다면 살 수밖에 없을 것이다",


	"親友にまで裏切られた (しんゆうにまでうらぎられた)": "친구에게까지 배신당했다",
	"迷惑だとまで言った (めいわくだとまでいった)": "귀찮다고까지 말했다",
	"列車で行くまでのことだ (れっしゃでいくまでのことだ)": "열차로 갈 따름이다",
	"率直な感想を述べたまでです (そっちょくなかんそうをのべためでです)": "솔직한 감상을 말했을 뿐입니다",
	"これまでだと覚悟を決める (これまでだとかくごをきめる)": "이제 끝장이라고 각오를 다지다",
	"うっかり消してしまえばそれまでだ (うっかりけしてしまえばそれまでだ)": "깜빡하고 지워버리면 그것으로 끝이다",
	"君にまで残業してもらうことになって (きみにまでざんぎょうしてもらうことになって)": "자네에게까지 잔업을 하게 되어서",
	"これが繰り返されていくうちに、小さな溝は大きな溝にまで発達します (これがくりかえされていくうちに、ちいさなみぞはおおきなみぞにまではったつします)": "이것이 반복되어 가는 동안, 작은 소용돌이는 큰 소용돌이로 발전합니다",
	"仕事に必要だったわけじゃない。興味があったから聞いてみたまでのことだ (しごとにひつようだったわけじゃない。きょうみがあったからきいてみたまでのことだ)": "업무에 필요했던 것은 아니다. 흥미가 있어서 물어봤을 뿐이다",
	"いくら先生が一生懸命教えたところで、学生にやる気がなければそれまでだ (いくらせんせいがいっしょうけんめいおしえたところで、がくせいにやるきがなければそれまでだ)": "아무리 선생님이 열심히 가르쳐 봤자, 학생한테 할 마음이 없으면 그것으로 끝이다",


	"親の希望もさることながら (おやのきぼうもさることながら)": "부모의 희망은 물론이거니와",
	"空腹や寒さもさることながら (くうふくやさむさもさることながら)": "배고픔이나 추위는 물론이거니와",
	"経済問題の解決には政府や企業の対応もさることながら (けいざいもんだいのかいけつにはせいふやきぎょうのたいおうもさることながら)": "경제문제 해결에는 정부나 기업의 대응은 물론이거니와",
	"このドラマの人気は、ストーリーもさることながら (このどらまのにんきは、すとーりーもさることながら)": "이 드라마의 인기는 스토리는 물론이거니와",
	"機能性もさることながらそのかわいらしいデザインが (きのうせいもさることながらそのかわいらしいでざいんが)": "기능성은 물론이거니와 그 귀여운 디자인이",
	"A教授は、研究業績もさることながら、政治手腕の方もなかなかのものだ。 (Aきょうじゅは、けんきゅうぎょうせきもさることながら、せいじしゅわんのほうもなかなかのものだ)": "A교수는 연구실적은 물론이거니와 정치 수완 쪽도 대단하다",


	"一言しゃべりもしないで (ひとことしゃべりもしないで)": "한 마디 말도 하지 않고",
	"私は深く考えもせず (わたしはふかくかんがえもせず)": "나는 깊이 생각하지도 않고",
	"挑戦しないことは受け入れられはしない (ちょうせんしないことはうけいれられはしない)": "도전하지 않는 것은 받아들여지지는 않는다",

	"間違い電話をかけてきて謝りもしないとは (まちがいでんわをかけてきてあやまりもしないとは)": "전화를 잘못 걸고는 사과하지도 않는다니",
	"多くの人に受けいれられはしない (おおくのひとにうけいれられはしない)": "많은 사람들에게 받아들여지지는 않는다",
	"読みもしないで漫画を批判するから (よみもしないでまんがをひはんするから)": "읽지도 않고 만화를 비판하니까",
	"まだ使えはするが (まだつかえはするが)": "아직 쓸 수 있기는 하지만",
	"編集者さんたちに気を使わせられはしない (へんしゅうしゃさんたちにきをつかわせられはしない)": "편집자분들이 신경 쓰게 하지는 않겠다",
	"彼女は、一言しゃべりもしないで帰ってしまった (かのじょは、ひとことしゃべりもしないでかえってしまった)": "그녀는 한 마디 말도 하지 않고 돌아가 버렸다",
	"たまにその猫がベランダに逃げ出して、うっかり落ちはしないかとはらはらします (たまにそのねこがべらんだににげだして、うっかりおちはしないかとはらはらします)": "가끔 그 고양이가 베란다로 도망가서, 까딱 잘못해서 떨어지지는 않을까 조마조마합니다",


	"人の心を動かすものがある (ひとのこころをうごかすものがある)": "사람의 마음을 움직이게 하는 데가 있다",
	"見るべきものがある (みるべきものがある)": "볼만한 것이 있다",
	"影響は少なからぬものがある (えいきょうはすくなからぬものがある)": "영향은 적지 않은 데가 있다",
	"30年ぶりに見る故郷の景色には、まことに感慨ぶかいものがある (さんじゅうねんぶりにみるこきょうのけしきには、まことにかんがいぶかいものがある)": "30년 만에 보는 고향의 풍경은 참으로 감개무량하다",



}

nihongo_15 = {
"これからも続けていってほしいものです (これからもつづけていってほしいものです)": "앞으로도 계속해 나가길 바랍니다",
"使う人の使い方次第で決まるものだ (つかうひとのつかいかたしだいできまるものだ)": "사용하는 사람이 어떻게 사용하느냐에 따라 정해지는 법이다",
"簡単に作れるものだと思った (かんたんにつくれるものだとおもった)": "간단히 만들 수 있구나 하고 생각했다",
"がんばればいいというものではない": "열심히만 하면 되는 게 아니다",
"そう簡単には治らないものだ (そうかんたんにはなおらないものだ)": "그렇게 쉽게는 고쳐지지 않는 법이다",
"どう考えてもさすがに無理ってもんだ (どうかんがえてもさすがにむりってもんだ)": "아무리 생각해도 역시 무리지",
"広いなんてもんじゃないよ (ひろいなんてもんじゃないよ)": "넓은 정도가 아니야",
"よく父のバイクの後ろに乗りたがったものだ (よくちちのバイクのうしろにのりたがったものだ)": "자주 아버지의 오토바이 뒤에 타고 싶어 했다",
"何でも知りたがるものです (なんでもしりたがるものです)": "뭐든지 알고 싶어하는 법입니다",

"「本を読め」とあんまり強制されると、かえって本が嫌いになるものです (「ほんをよめ」とあんまりきょうせいされると、かえってほんがきらいになるものです)": "‘책을 읽어’라고 너무 강요받으면, 오히려 책이 싫어지게 되는 법입니다",
"市民運動には、できるだけ政治の介入を避けたいものだ (しみんうんどうには、できるだけせいじのかいにゅうをさけたいものだ)": "시민운동에는, 가능한 한 정치의 개입을 피하고 싶다",
"一年の間、本当にいろいろな事件があったものですね (いちねんのあいだ、ほんとうにいろいろなじけんがあったものですね)": "1년 동안, 정말로 여러 사건이 있었네요",
"人が真面目な話をしている時に、ニヤニヤ笑ったりするものではありません (ひとがまじめなはなしをしているときに、にやにやわらったりするものではありません)": "남이 진지한 이야기를 하고 있을 때, 히죽히죽 웃거나 하는 게 아닙니다",
                                    
}